[
    
    {
        "id": "matrix",
        "title": "The Matrix",
        "genre": "Action Movies, Science Fiction Movies, Blu-Ray Movies",
        "director": " Lana Wachowski, Lilly Wachowski",
        "actors": "Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss",
        "description": "The Matrix, directed and written by the Wachowski siblings (Lana and Lilly), is a science fiction and action film. Starring Laurence Fishburne, Hugo Weaving, Marcus Chong, and Keanu Reeves as the main characters, the film is available on our site in 4K resolution. Additionally, a Full HD 1080p resolution option is provided for viewers experiencing hardware issues.\n\nAfter years of research, Morpheus and Trinity finally uncover information about a man who can manipulate the Matrix universe and might be the one they’ve been searching for. Another resistance member, Cypher, enters the Matrix first and heads to the Heart O’ The City Hotel to gather the final details about the man’s location.\n\nThe film begins with a phone call from Trinity to Cypher, asking if everything is ready for their encounter with the man. During their conversation, Trinity realizes the call is being traced and abruptly hangs up. Shortly after, law enforcement arrives at the hotel to arrest Trinity, a notorious hacker in Mega City. Three agents arrive at the scene and inform the police lieutenant that their men in the hotel are already dead.\n\nIn Room 303 of the hotel, police officers attempt to arrest Trinity, but she resists and overpowers them. She calls Morpheus, asking for an escape route. Morpheus warns her that agents are coming for her and urges her to flee. Trinity reaches an exit just before Agent Smith crashes a truck through the phone booth, allowing her to escape the Matrix. As Trinity leaves, the three agents meet and realize they are searching for a man named Neo, deciding to pursue him as well.\n\nThomas Anderson, living a double life as a computer programmer and a hacker under the alias \"Neo,\" is determined to uncover the meaning behind cryptic references to the \"Matrix\" appearing on his computer, which unsettles him. The infamous hacker Trinity contacts Neo, telling him that a man named Morpheus can reveal the truth about the Matrix. However, three agents arrest Neo to prevent him from collaborating with Morpheus.\n\nNeo meets Morpheus and chooses the red pill from the two pills offered, confirming his desire to learn more about the Matrix. After swallowing the pill, Neo suddenly awakens in a liquid-filled pod, connected to an elaborate electrical structure alongside millions of other humans.",
        "trailer": "https://www.youtube.com/embed/vKQi3bBA1y8",
        "image": "../images/the_matrix.jpg",
        "year": "1999",
        "imdb_rating": "8.8"
    },
    {
        "id": "fight_club",
        "title": "Fight Club",
        "genre": "Drama Movies, Thriller Movies, Blu-Ray Movies",
        "director": "David Fincher",
        "actors": "Brad Pitt, Edward Norton, Helena Bonham Carter",
        "description": "Fight Club, directed by David Fincher, is a provocative drama and thriller based on Chuck Palahniuk’s novel. Starring Brad Pitt, Edward Norton, and Helena Bonham Carter, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers experiencing hardware issues.\n\nThe story follows an unnamed narrator, a disillusioned office worker struggling with insomnia and a mundane life. He meets Tyler Durden, a charismatic and anarchistic soap salesman, and the two form an underground ‘fight club’ where men gather to vent their frustrations through bare-knuckle brawls. As the club grows, Tyler transforms it into a chaotic anti-consumerist movement with far-reaching consequences.\n\nThe film opens with the narrator’s monotonous existence, disrupted by his chance encounter with Tyler on a flight. Their friendship sparks the creation of Fight Club, which evolves from basement fights to organized rebellion. The narrator’s relationship with Marla Singer, a troubled woman drawn into their orbit, adds tension. As Tyler’s plans escalate, the narrator grapples with the destructive path they’ve unleashed, leading to a mind-bending climax.\n\nFight Club is a darkly satirical exploration of identity, masculinity, and rebellion against societal norms.",
        "trailer": "https://www.youtube.com/embed/SUXWAEX2jlg",
        "image": "../images/the_fight_club.jpg",
        "year": "1999",
        "imdb_rating": "8.8"
    },
    {
        "id": "the_godfather",
        "title": "The Godfather",
        "genre": "Crime Movies, Drama Movies, Blu-Ray Movies",
        "director": "Francis Ford Coppola",
        "actors": "Marlon Brando, Al Pacino, James Caan",
        "description": "The Godfather, directed by Francis Ford Coppola, is a landmark crime drama based on Mario Puzo’s novel. Starring Marlon Brando, Al Pacino, James Caan, and Diane Keaton, the film is available on our site in 4K resolution. A Full HD 1080p option is also provided for viewers with hardware limitations.\n\nThe story follows the Corleone family, a powerful Italian-American mafia dynasty led by patriarch Vito Corleone. When Vito survives an assassination attempt, his youngest son, Michael, initially reluctant to join the family business, is drawn into the world of organized crime. As rival families vie for control of New York’s underworld, Michael’s transformation from an outsider to a ruthless mafia boss unfolds.\n\nThe film opens with a grand wedding scene, where favors are requested of Vito, showcasing his influence. Tensions rise as the Corleones face betrayal and escalating violence. Michael’s journey takes him from a war hero to a calculating leader, navigating alliances and vendettas. Key moments, like the strategic meeting with rival families and Michael’s decisive actions, cement the film’s exploration of power, loyalty, and family.\n\nThe Godfather is a gripping tale of moral descent and the cost of power, set against a richly detailed backdrop of 1940s America.",
        "trailer": "https://www.youtube.com/embed/sY1S34973zA",
        "image": "../images/godfather.jpg",
        "year": "1972",
        "imdb_rating": "9.2"
      },
      {
        "id": "interstellar",
        "title": "Interstellar",
        "genre": "Science Fiction Movies, Drama Movies, Blu-Ray Movies",
        "director": "Christopher Nolan",
        "actors": "Matthew McConaughey, Anne Hathaway, Jessica Chastain",
        "description": "Interstellar, directed by Christopher Nolan, is a visually stunning science fiction epic. Starring Matthew McConaughey, Anne Hathaway, Jessica Chastain, and Michael Caine, the film is available on our site in 4K resolution, with a Full HD 1080p option for those with hardware constraints.\n\nSet in a dystopian future where Earth’s resources are dwindling, the story follows former NASA pilot Cooper, who leads a team of astronauts on a desperate mission to find a new habitable planet. Guided by a mysterious wormhole near Saturn, the crew ventures into deep space, facing the unknown to ensure humanity’s survival.\n\nThe film begins with Cooper discovering a secret NASA facility, where he’s recruited for the mission. As the team navigates treacherous planets and grapples with the effects of time dilation, Cooper’s bond with his daughter, Murph, drives his determination. Key sequences, like the harrowing docking maneuver and the exploration of a black hole, push the boundaries of science and emotion.\n\nInterstellar blends cutting-edge visuals with profound themes of sacrifice, love, and human resilience, making it a modern sci-fi masterpiece.",
        "trailer": "https://www.youtube.com/embed/zSWdZVtXT7E",
        "image": "../images/interstellar.jpg",
        "year": "2014",
        "imdb_rating": "8.7"
      },
      {
        "id": "se7en",
        "title": "Se7en",
        "genre": "Crime Movies, Thriller Movies, Blu-Ray Movies",
        "director": "David Fincher",
        "actors": "Brad Pitt, Morgan Freeman, Gwyneth Paltrow",
        "description": "Se7en, directed by David Fincher, is a chilling crime thriller. Starring Brad Pitt, Morgan Freeman, Gwyneth Paltrow, and Kevin Spacey, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers experiencing hardware issues.\n\nThe story follows two detectives—veteran William Somerset and rookie David Mills—as they investigate a series of gruesome murders in a rain-soaked, decaying city. Each killing is meticulously crafted to reflect one of the seven deadly sins, leading the detectives into a psychological cat-and-mouse game with a brilliant but deranged killer.\n\nThe film opens with Somerset, nearing retirement, reluctantly partnering with the impulsive Mills. As the body count rises, the detectives uncover clues pointing to a methodical killer with a twisted moral agenda. The investigation tests their resolve, culminating in a shocking and unforgettable climax that redefines the stakes of justice.\n\nSe7en is a dark, atmospheric masterpiece that explores morality, despair, and the human condition, leaving a lasting impact on the thriller genre.",
        "trailer": "https://www.youtube.com/embed/znmZoVkCjpI",
        "image": "../images/se7en.jpg",
        "year": "1995",
        "imdb_rating": "8.6"
      },
      {
        "id": "the_shawshank_redemption",
        "title": "The Shawshank Redemption",
        "genre": "Drama Movies, Blu-Ray Movies",
        "director": "Frank Darabont",
        "actors": "Tim Robbins, Morgan Freeman, Bob Gunton",
        "description": "The Shawshank Redemption, directed by Frank Darabont, is a powerful drama based on Stephen King’s novella. Starring Tim Robbins, Morgan Freeman, and Bob Gunton, the film is available on our site in 4K resolution, with a Full HD 1080p option for those with hardware limitations.\n\nThe story follows Andy Dufresne, a young banker wrongfully convicted of murdering his wife and her lover, sentenced to life in Shawshank Prison. Over decades, Andy forms an unlikely friendship with fellow inmate Red and quietly navigates the brutal realities of prison life, holding onto hope in the face of despair.\n\nThe film begins with Andy’s arrival at Shawshank, where he faces corrupt guards and a predatory inmate culture. Through small acts of defiance and ingenuity, Andy earns respect and transforms the prison’s library, offering solace to others. His friendship with Red deepens, revealing their contrasting outlooks on hope and redemption. A series of revelations leads to a breathtaking conclusion that celebrates the human spirit.\n\nThe Shawshank Redemption is a timeless tale of resilience, friendship, and the enduring power of hope.",
        "trailer": "https://www.youtube.com/embed/6hB3S9bIaco",
        "image": "../images/the_shawshank_redemption.jpg",
        "year": "1994",
        "imdb_rating": "9.3"
      },
      {
        "id": "the_pianist",
        "title": "The Pianist",
        "genre": "Drama Movies, War Movies, Blu-Ray Movies",
        "director": "Roman Polanski",
        "actors": "Adrien Brody, Thomas Kretschmann, Frank Finlay",
        "description": "The Pianist, directed by Roman Polanski, is a harrowing drama based on Władysław Szpilman’s memoir. Starring Adrien Brody, Thomas Kretschmann, and Frank Finlay, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nThe story follows Szpilman, a Polish-Jewish pianist, as he struggles to survive the Holocaust in Nazi-occupied Warsaw. Separated from his family, he hides in the city’s ruins, relying on his music and resilience to endure unimaginable hardships.\n\nThe film opens with Szpilman performing on radio as bombs fall on Warsaw. As the Nazis tighten their grip, his family is forced into the Warsaw Ghetto. Szpilman escapes deportation and survives in hiding, aided by strangers and his passion for music. His encounters with a German officer add a complex layer to his survival story, leading to a poignant conclusion.\n\nThe Pianist is a powerful testament to the human spirit and the enduring power of art in the face of atrocity.",
        "trailer": "https://www.youtube.com/embed/BFwGqLa_oAo",
        "image": "../images/the_pianist.jpeg",
        "year": "2002",
        "imdb_rating": "8.5"
      },
      {
        "id": "the_lion_king",
        "title": "The Lion King",
        "genre": "Animation Movies, Adventure Movies, Blu-Ray Movies",
        "director": "Roger Allers, Rob Minkoff",
        "actors": "Matthew Broderick, Jeremy Irons, James Earl Jones",
        "description": "The Lion King, directed by Roger Allers and Rob Minkoff, is a beloved animated adventure. Starring Matthew Broderick, Jeremy Irons, and James Earl Jones, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nThe story follows Simba, a young lion prince, who flees his home after his father, King Mufasa, is killed by his scheming uncle Scar. Exiled and guilt-ridden, Simba grows up with unlikely friends, only to return and reclaim his rightful place as king.\n\nThe film opens with the iconic Circle of Life, introducing the vibrant Pride Lands. Scar’s betrayal leads to Mufasa’s death, prompting Simba’s escape. Guided by Timon and Pumbaa, he embraces a carefree life until his past calls him back. Simba’s confrontation with Scar is a dramatic climax of courage and redemption.\n\nThe Lion King is a timeless tale of family, duty, and self-discovery, brought to life with stunning animation and unforgettable music.",
        "trailer": "https://www.youtube.com/embed/4sj1MT05lAA",
        "image": "../images/the_lion_king.jpg",
        "year": "1994",
        "imdb_rating": "8.5"
      },
      {
        "id": "spider_man_across_the_spider_verse",
        "title": "Spider-Man: Across the Spider-Verse",
        "genre": "Animation Movies, Action Movies, Blu-Ray Movies",
        "director": "Joaquim Dos Santos, Kemp Powers, Justin K. Thompson",
        "actors": "Shameik Moore, Hailee Steinfeld, Brian Tyree Henry",
        "description": "Spider-Man: Across the Spider-Verse, directed by Joaquim Dos Santos, Kemp Powers, and Justin K. Thompson, is a groundbreaking animated action film. Starring Shameik Moore, Hailee Steinfeld, and Brian Tyree Henry, it is available on our site in 4K resolution, with a Full HD 1080p option for hardware-limited viewers.\n\nMiles Morales catapults across the multiverse, joining a team of Spider-People tasked with protecting its existence. When a new threat emerges, Miles clashes with the team’s methods, forcing him to redefine what it means to be a hero.\n\nThe film begins with Miles balancing his life as Spider-Man and a teenager. A new villain, The Spot, triggers a multiversal chase, leading Miles to Gwen Stacy and a diverse Spider-Society. As tensions rise, Miles uncovers a shocking truth, setting the stage for a thrilling cliffhanger.\n\nAcross the Spider-Verse dazzles with bold animation and heartfelt storytelling, pushing the boundaries of the superhero genre.",
        "trailer": "https://www.youtube.com/embed/shW9i6k8G98",
        "image": "../images/spiderman_across_the_spider-verse.jpg",
        "year": "2023",
        "imdb_rating": "8.6"
      },
      {
        "id": "dune_part_two",
        "title": "Dune: Part Two",
        "genre": "Science Fiction Movies, Adventure Movies, Blu-Ray Movies",
        "director": "Denis Villeneuve",
        "actors": "Timothée Chalamet, Zendaya, Rebecca Ferguson",
        "description": "Dune: Part Two, directed by Denis Villeneuve, is an epic science fiction sequel. Starring Timothée Chalamet, Zendaya, and Rebecca Ferguson, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nPaul Atreides unites with the Fremen to seek revenge against those who destroyed his family. Facing a choice between love and the fate of the universe, he strives to prevent a catastrophic future only he can foresee.\n\nThe film opens with Paul and his mother, Lady Jessica, adapting to Fremen life on Arrakis. As Paul embraces his destiny, he leads a rebellion against the Harkonnens and the Emperor. Epic battles and political intrigue culminate in a climactic showdown that shapes the galaxy’s future.\n\nDune: Part Two is a visually spectacular saga of power, prophecy, and survival.",
        "trailer": "https://www.youtube.com/embed/Way9Dexny3w",
        "image": "../images/dune_part_two.jpg",
        "year": "2024",
        "imdb_rating": "8.6"
      },
      {
        "id": "memento",
        "title": "Memento",
        "genre": "Thriller Movies, Mystery Movies, Blu-Ray Movies",
        "director": "Christopher Nolan",
        "actors": "Guy Pearce, Carrie-Anne Moss, Joe Pantoliano",
        "description": "Memento, directed by Christopher Nolan, is a mind-bending thriller. Starring Guy Pearce, Carrie-Anne Moss, and Joe Pantoliano, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nLeonard Shelby, suffering from short-term memory loss, searches for his wife’s killer. Using notes, tattoos, and Polaroids, he pieces together clues in a fragmented narrative, unsure whom to trust.\n\nThe film alternates between black-and-white and color sequences, unraveling Leonard’s investigation backward. As he follows leads, encounters with a mysterious woman and a shady acquaintance blur the line between ally and foe. The nonlinear storytelling builds to a shocking revelation.\n\nMemento is a gripping exploration of memory, truth, and deception, redefining the thriller genre.",
        "trailer": "https://www.youtube.com/embed/UFuFFdK7iXk",
        "image": "../images/memento.jpg",
        "year": "2000",
        "imdb_rating": "8.4"
      },
      {
        "id": "spider_man_into_the_spider_verse",
        "title": "Spider-Man: Into the Spider-Verse",
        "genre": "Animation Movies, Action Movies, Blu-Ray Movies",
        "director": "Bob Persichetti, Peter Ramsey, Rodney Rothman",
        "actors": "Shameik Moore, Jake Johnson, Hailee Steinfeld",
        "description": "Spider-Man: Into the Spider-Verse, directed by Bob Persichetti, Peter Ramsey, and Rodney Rothman, is a revolutionary animated action film. Starring Shameik Moore, Jake Johnson, and Hailee Steinfeld, it is available on our site in 4K resolution, with a Full HD 1080p option for hardware-limited viewers.\n\nTeen Miles Morales becomes Spider-Man in his universe and joins five spider-powered individuals from other dimensions to stop a multiversal threat.\n\nThe film follows Miles as he grapples with his new powers after a radioactive spider bite. Mentored by a weary Peter Parker, Miles teams up with diverse Spider-People to thwart Kingpin’s plan. Vibrant visuals and a heartfelt story lead to an action-packed finale.\n\nInto the Spider-Verse is a bold, emotional adventure that redefines Spider-Man for a new generation.",
        "trailer": "https://www.youtube.com/embed/g4Hbz2jLxvQ",
        "image": "../images/spiderman_into_the_spider-verse.jpg",
        "year": "2018",
        "imdb_rating": "8.4"
      },
      {
        "id": "coco",
        "title": "Coco",
        "genre": "Animation Movies, Adventure Movies, Blu-Ray Movies",
        "director": "Lee Unkrich, Adrian Molina",
        "actors": "Anthony Gonzalez, Gael García Bernal, Benjamin Bratt",
        "description": "Coco, directed by Lee Unkrich and Adrian Molina, is a vibrant animated adventure. Starring Anthony Gonzalez, Gael García Bernal, and Benjamin Bratt, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nAspiring musician Miguel, banned from music by his family, enters the Land of the Dead to find his great-great-grandfather, a legendary singer, and uncover his family’s secrets.\n\nThe film opens with Miguel defying his family’s music ban during Día de los Muertos. Transported to a colorful afterlife, he teams up with a charming trickster, Héctor, to find his idol. Their journey reveals hidden truths, culminating in an emotional reunion.\n\nCoco is a heartfelt celebration of family, tradition, and pursuing dreams, wrapped in stunning visuals.",
        "trailer": "https://www.youtube.com/embed/zNCz4mCjbtg",
        "image": "../images/coco.jpg",
        "year": "2017",
        "imdb_rating": "8.4"
      },
      {
        "id": "toy_story",
        "title": "Toy Story",
        "genre": "Animation Movies, Adventure Movies, Blu-Ray Movies",
        "director": "John Lasseter",
        "actors": "Tom Hanks, Tim Allen, Don Rickles",
        "description": "Toy Story, directed by John Lasseter, is a pioneering animated adventure. Starring Tom Hanks, Tim Allen, and Don Rickles, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nA cowboy doll, Woody, feels threatened when a new spaceman toy, Buzz Lightyear, becomes the favorite in a boy’s room, sparking a rivalry that leads to an unexpected journey.\n\nThe film begins with Woody leading a tight-knit toy community. Buzz’s arrival disrupts the balance, leading to a mishap that strands them far from home. Their misadventures force them to work together, forging a friendship that saves the day.\n\nToy Story is a timeless tale of loyalty and camaraderie, brought to life with groundbreaking animation.",
        "trailer": "https://www.youtube.com/embed/v-PjgYDrg70",
        "image": "../images/toy_story.jpg",
        "year": "1995",
        "imdb_rating": "8.3"
      },
      {
        "id": "avengers_endgame",
        "title": "Avengers: Endgame",
        "genre": "Action Movies, Science Fiction Movies, Blu-Ray Movies",
        "director": "Anthony Russo, Joe Russo",
        "actors": "Robert Downey Jr., Chris Evans, Mark Ruffalo",
        "description": "Avengers: Endgame, directed by Anthony and Joe Russo, is an epic superhero saga. Starring Robert Downey Jr., Chris Evans, and Mark Ruffalo, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nAfter Thanos’ devastating actions, the Avengers assemble to reverse his destruction and restore balance to the universe, at any cost.\n\nThe film opens with the heroes reeling from loss. A daring plan to travel through time unites the team, leading to encounters with past selves and new allies. Sacrifices and epic battles culminate in a climactic showdown that redefines heroism.\n\nAvengers: Endgame is a thrilling, emotional culmination of the Marvel saga, packed with spectacle and heart.",
        "trailer": "https://www.youtube.com/embed/TcMBFSGVi1c",
        "image": "../images/avengers_endgame.jpg",
        "year": "2019",
        "imdb_rating": "8.4"
      },
      {
        "id": "braveheart",
        "title": "Braveheart",
        "genre": "Drama Movies, War Movies, Blu-Ray Movies",
        "director": "Mel Gibson",
        "actors": "Mel Gibson, Sophie Marceau, Patrick McGoohan",
        "description": "Braveheart, directed by Mel Gibson, is a sweeping historical epic. Starring Mel Gibson, Sophie Marceau, and Patrick McGoohan, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nWilliam Wallace, a Scottish warrior, leads a rebellion against English oppression after personal tragedy, rallying his people for freedom.\n\nThe film begins with Wallace’s peaceful life shattered by English cruelty. His defiance sparks a guerrilla war, uniting clans against a tyrannical king. Epic battles and political intrigue lead to a stirring, tragic climax.\n\nBraveheart is a rousing tale of courage, sacrifice, and the fight for liberty, brought to life with visceral intensity.",
        "trailer": "https://www.youtube.com/embed/1NJO0jxBtMo",
        "image": "../images/brave_heart.jpg",
        "year": "1995",
        "imdb_rating": "8.3"
      },
      {
        "id": "joker",
        "title": "Joker",
        "genre": "Drama Movies, Thriller Movies, Blu-Ray Movies",
        "director": "Todd Phillips",
        "actors": "Joaquin Phoenix, Robert De Niro, Zazie Beetz",
        "description": "Joker, directed by Todd Phillips, is a dark psychological thriller. Starring Joaquin Phoenix, Robert De Niro, and Zazie Beetz, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nArthur Fleck, a struggling comedian, descends into chaos as society’s neglect and cruelty push him to embrace a violent alter ego in Gotham City.\n\nThe film follows Arthur’s impoverished life, marked by rejection and mental instability. Small acts of defiance escalate into a citywide uprising, blurring the line between victim and villain. The climax is a chilling portrait of anarchy.\n\nJoker is a haunting exploration of alienation and societal breakdown, anchored by a transformative performance.",
        "trailer": "https://www.youtube.com/embed/t433PEQGErc",
        "image": "../images/joker.jpg",
        "year": "2019",
        "imdb_rating": "8.4"
      },
      {
        "id": "logan",
        "title": "Logan",
        "genre": "Action Movies, Drama Movies, Blu-Ray Movies",
        "director": "James Mangold",
        "actors": "Hugh Jackman, Patrick Stewart, Dafne Keen",
        "description": "Logan, directed by James Mangold, is a gritty superhero drama. Starring Hugh Jackman, Patrick Stewart, and Dafne Keen, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nIn a bleak future, an aging Wolverine, caring for a frail Professor X, protects a young mutant girl from ruthless pursuers.\n\nThe film opens with Logan, weakened and weary, hiding in a dystopian world. A mysterious girl, Laura, forces him back into action. Their brutal journey reveals shared bonds, leading to a heart-wrenching stand.\n\nLogan is a raw, emotional farewell to a legendary hero, blending intense action with profound humanity.",
        "trailer": "https://www.youtube.com/embed/Div0iP65aZo",
        "image": "../images/logan.jpeg",
        "year": "2017",
        "imdb_rating": "8.1"
      },
      {
        "id": "rush",
        "title": "Rush",
        "genre": "Drama Movies, Sports Movies, Blu-Ray Movies",
        "director": "Ron Howard",
        "actors": "Chris Hemsworth, Daniel Brühl, Olivia Wilde",
        "description": "Rush, directed by Ron Howard, is a thrilling sports drama. Starring Chris Hemsworth, Daniel Brühl, and Olivia Wilde, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nThe intense rivalry between Formula 1 drivers James Hunt and Niki Lauda in the 1970s pushes them to their limits, both on and off the track.\n\nThe film contrasts Hunt’s reckless charisma with Lauda’s disciplined precision. Their competition peaks during the 1976 season, marked by a near-fatal crash and a dramatic comeback. The final race cements their legacy.\n\nRush is a high-octane tale of ambition, resilience, and respect, fueled by gripping races and human drama.",
        "trailer": "https://www.youtube.com/embed/wk5--_T6_0c",
        "image": "../images/rush.jpg",
        "year": "2013",
        "imdb_rating": "8.1"
      },
      {
        "id": "sinners",
        "title": "Sinners",
        "genre": "Horror Movies, Thriller Movies, Blu-Ray Movies",
        "director": "Ryan Coogler",
        "actors": "Michael B. Jordan, Hailee Steinfeld, Jack O'Connell",
        "description": "Sinners, directed by Ryan Coogler, is a chilling horror thriller. Starring Michael B. Jordan, Hailee Steinfeld, and Jack O'Connell, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nSet in 1930s Louisiana, twin brothers return from war to their hometown, only to face a sinister supernatural force tied to their past, threatening their lives and sanity.\n\nThe film opens with the brothers’ uneasy homecoming, haunted by war’s scars. Strange occurrences escalate into terrifying encounters, forcing them to confront a dark family secret. Their fight for survival builds to a shocking, blood-soaked climax.\n\nSinners is a haunting blend of psychological horror and Southern Gothic, delivering visceral scares and emotional depth.",
        "trailer": "https://www.youtube.com/embed/YOUR_TRAILER_LINK",
        "image": "../images/sinners.jpg",
        "year": "2024",
        "imdb_rating": "7.1"
      },
      {
        "id": "the_wild_robot",
        "title": "The Wild Robot",
        "genre": "Animation Movies, Adventure Movies, Blu-Ray Movies",
        "director": "Chris Sanders",
        "actors": "Lupita Nyong'o, Pedro Pascal, Catherine O'Hara",
        "description": "The Wild Robot, directed by Chris Sanders, is a heartfelt animated adventure. Starring Lupita Nyong'o, Pedro Pascal, and Catherine O'Hara, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nAfter a shipwreck, an intelligent robot, Roz, is stranded on an uninhabited island. To survive, she bonds with the island’s animals and cares for an orphaned baby goose.\n\nThe film follows Roz’s struggle to adapt to the wild, learning from her animal companions. Her caregiving sparks unexpected connections, but a corporate threat looms. Roz’s journey of self-discovery leads to a touching, heroic stand.\n\nThe Wild Robot is a visually stunning story of love, adaptation, and found family.",
        "trailer": "https://www.youtube.com/embed/yEGC4r2T3X8",
        "image": "../images/the_wild_robot.jpg",
        "year": "2024",
        "imdb_rating": "8.1"
      },
      {
        "id": "warrior",
        "title": "Warrior",
        "genre": "Drama Movies, Sports Movies, Blu-Ray Movies",
        "director": "Gavin O'Connor",
        "actors": "Tom Hardy, Joel Edgerton, Nick Nolte",
        "description": "Warrior, directed by Gavin O’Connor, is a gripping sports drama. Starring Tom Hardy, Joel Edgerton, and Nick Nolte, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nTwo estranged brothers, a former Marine and a physics teacher, compete in a high-stakes MMA tournament, confronting their fractured family past.\n\nThe film follows Tommy’s return from war and Brendan’s struggle to provide for his family. Both enter the tournament for different reasons, clashing with their alcoholic father. Their paths converge in an emotional, brutal showdown.\n\nWarrior is a raw, uplifting story of redemption, family, and fighting for what matters.",
        "trailer": "https://www.youtube.com/embed/I5k99CX4S2E",
        "image": "../images/warrior.jpg",
        "year": "2011",
        "imdb_rating": "8.1"
      },
      {
        "id": "1917",
        "title": "1917",
        "genre": "War Movies, Drama Movies, Blu-Ray Movies",
        "director": "Sam Mendes",
        "actors": "George MacKay, Dean-Charles Chapman, Mark Strong",
        "description": "1917, directed by Sam Mendes, is a visceral war drama. Starring George MacKay, Dean-Charles Chapman, and Mark Strong, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nDuring World War I, two British soldiers undertake a perilous mission to deliver a message across enemy lines to save 1,600 men from a trap.\n\nThe film unfolds in real-time, following the soldiers through treacherous trenches and battlefields. Their race against time tests their courage and loyalty, leading to a harrowing, heroic conclusion.\n\n1917 is a technically dazzling and emotionally gripping portrayal of duty and survival in wartime.",
        "trailer": "https://www.youtube.com/embed/YqNYrYUiMfg",
        "image": "../images/1917.jpg",
        "year": "2019",
        "imdb_rating": "8.2"
      },
      {
        "id": "django_unchained",
        "title": "Django Unchained",
        "genre": "Western Movies, Drama Movies, Blu-Ray Movies",
        "director": "Quentin Tarantino",
        "actors": "Jamie Foxx, Christoph Waltz, Leonardo DiCaprio",
        "description": "Django Unchained, directed by Quentin Tarantino, is a bold Western drama. Starring Jamie Foxx, Christoph Waltz, and Leonardo DiCaprio, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nA freed slave, Django, teams with a bounty hunter to rescue his wife from a sadistic plantation owner in the antebellum South.\n\nThe film follows Django’s transformation from captive to gunslinger under Dr. King Schultz’s mentorship. Their quest leads to a brutal plantation ruled by Calvin Candie. Explosive confrontations and sharp dialogue drive a fiery climax.\n\nDjango Unchained is a stylish, unflinching tale of vengeance and liberation.",
        "trailer": "https://www.youtube.com/embed/eUDcT6svC4A",
        "image": "../images/django.jpg",
        "year": "2012",
        "imdb_rating": "8.5"
      },
      {
        "id": "the_martian",
        "title": "The Martian",
        "genre": "Science Fiction Movies, Adventure Movies, Blu-Ray Movies",
        "director": "Ridley Scott",
        "actors": "Matt Damon, Jessica Chastain, Kristen Wiig",
        "description": "The Martian, directed by Ridley Scott, is a gripping science fiction adventure. Starring Matt Damon, Jessica Chastain, and Kristen Wiig, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nAstronaut Mark Watney, stranded on Mars after a mission accident, uses his ingenuity to survive while NASA races to rescue him.\n\nThe film follows Watney’s solitary struggle, from growing food to contacting Earth. His humor and resourcefulness contrast with NASA’s high-stakes efforts. The global mission to save him builds to a tense, triumphant finale.\n\nThe Martian is an inspiring blend of science, survival, and human determination.",
        "trailer": "https://www.youtube.com/embed/ej3ioOneTy8",
        "image": "../images/martian.jpeg",
        "year": "2015",
        "imdb_rating": "8.0"
      },
      {
        "id": "v_for_vendetta",
        "title": "V for Vendetta",
        "genre": "Action Movies, Thriller Movies, Blu-Ray Movies",
        "director": "James McTeigue",
        "actors": "Natalie Portman, Hugo Weaving, Stephen Rea",
        "description": "V for Vendetta, directed by James McTeigue, is a provocative thriller. Starring Natalie Portman, Hugo Weaving, and Stephen Rea, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nIn a dystopian future, a masked vigilante, V, inspires a rebellion against a totalitarian regime, guiding a young woman to challenge oppression.\n\nThe film follows Evey’s transformation under V’s influence, from fear to defiance. His theatrical acts of resistance, like blowing up landmarks, spark a revolution. The climactic uprising is both explosive and symbolic.\n\nV for Vendetta is a bold meditation on freedom, resistance, and identity.",
        "trailer": "https://www.youtube.com/embed/lSA7mAHolAw",
        "image": "../images/v_for_vendetta.jpg",
        "year": "2005",
        "imdb_rating": "8.2"
      },
      {
        "id": "i_am_legend",
        "title": "I Am Legend",
        "genre": "Science Fiction Movies, Horror Movies, Blu-Ray Movies",
        "director": "Francis Lawrence",
        "actors": "Will Smith, Alice Braga, Charlie Tahan",
        "description": "I Am Legend, directed by Francis Lawrence, is a tense science fiction horror. Starring Will Smith, Alice Braga, and Charlie Tahan, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nVirologist Robert Neville, seemingly the last human in a post-apocalyptic New York, hunts for a cure while fending off infected mutants.\n\nThe film follows Neville’s solitary life, scavenging and broadcasting for survivors. His bond with his dog and flashbacks to his past add depth. A discovery about the infected leads to a desperate, sacrificial stand.\n\nI Am Legend is a haunting exploration of isolation and hope against overwhelming odds.",
        "trailer": "https://www.youtube.com/embed/dtKMEAXyPkg",
        "image": "../images/i_am_legend.jpg",
        "year": "2007",
        "imdb_rating": "7.2"
      },
      {
        "id": "the_maze_runner",
        "title": "The Maze Runner",
        "genre": "Science Fiction Movies, Action Movies, Blu-Ray Movies",
        "director": "Wes Ball",
        "actors": "Dylan O'Brien, Kaya Scodelario, Thomas Brodie-Sangster",
        "description": "The Maze Runner, directed by Wes Ball, is a thrilling science fiction action film. Starring Dylan O’Brien, Kaya Scodelario, and Thomas Brodie-Sangster, it is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nThomas wakes up in a mysterious glade with no memories, surrounded by boys and a deadly maze. He leads a group to escape while uncovering dark secrets.\n\nThe film opens with Thomas arriving in the Glade, facing hostility and confusion. His curiosity drives him to explore the maze, revealing monstrous creatures. Alliances form as the group fights for freedom, leading to a shocking revelation.\n\nThe Maze Runner is a fast-paced tale of survival, mystery, and rebellion.",
        "trailer": "https://www.youtube.com/embed/AwwbhhjQ9Xk",
        "image": "../images/maze_runner.jpg",
        "year": "2014",
        "imdb_rating": "6.8"
      },
      {
        "id": "jumper",
        "title": "Jumper",
        "genre": "Science Fiction Movies, Action Movies, Blu-Ray Movies",
        "director": "Doug Liman",
        "actors": "Hayden Christensen, Jamie Bell, Rachel Bilson",
        "description": "Jumper, directed by Doug Liman, is a dynamic science fiction action film. Starring Hayden Christensen, Jamie Bell, and Rachel Bilson, it is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nDavid Rice discovers he can teleport, using his ability to live freely until a secret organization hunts him, forcing a fight for survival.\n\nThe film follows David’s carefree life of jumping across the globe, from bank vaults to exotic locales. A rival jumper and relentless pursuers upend his freedom, leading to a high-stakes chase. Alliances and betrayals culminate in a teleporting showdown.\n\nJumper is a thrilling ride of power, pursuit, and self-discovery.",
        "trailer": "https://www.youtube.com/embed/0gBQ1-6FhNE",
        "image": "../images/jumper.jpg",
        "year": "2008",
        "imdb_rating": "6.1"
      },
      {
        "id": "fury",
        "title": "Fury",
        "genre": "War Movies, Action Movies, Blu-Ray Movies",
        "director": "David Ayer",
        "actors": "Brad Pitt, Shia LaBeouf, Logan Lerman",
        "description": "Fury, directed by David Ayer, is a gritty war drama. Starring Brad Pitt, Shia LaBeouf, and Logan Lerman, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nIn April 1945, a battle-hardened tank commander, Wardaddy, leads his crew through Nazi Germany on a deadly mission. A rookie gunner, Norman, must adapt to the horrors of war as they face overwhelming odds.\n\nThe film opens with the crew of the tank ‘Fury’ navigating a ravaged landscape. As they undertake a suicidal mission, tensions rise between the seasoned veterans and the inexperienced Norman. Brutal battles and camaraderie build to a desperate, heroic stand against an SS battalion.\n\nFury is a raw, visceral portrayal of brotherhood, sacrifice, and the brutal realities of war.",
        "trailer": "https://www.youtube.com/embed/q94n3eWOWXM",
        "image": "../images/fury.jpeg",
        "year": "2014",
        "imdb_rating": "7.6"
      },
      {
        "id": "top_gun_maverick",
        "title": "Top Gun: Maverick",
        "genre": "Action Movies, Drama Movies, Blu-Ray Movies",
        "director": "Joseph Kosinski",
        "actors": "Tom Cruise, Miles Teller, Jennifer Connelly",
        "description": "Top Gun: Maverick, directed by Joseph Kosinski, is a high-octane action drama. Starring Tom Cruise, Miles Teller, and Jennifer Connelly, the film is available on our site in 4K resolution, with a Full HD 1080p option for viewers with hardware issues.\n\nAfter decades as a Navy test pilot, Pete ‘Maverick’ Mitchell trains a group of elite Top Gun graduates for a near-impossible mission to destroy an enemy facility, confronting his past along the way.\n\nThe film follows Maverick’s return to the Top Gun program, clashing with superiors and bonding with young pilots, including Rooster, the son of his late friend. Heart-pounding dogfights and personal reconciliation drive a thrilling, high-stakes climax.\n\nTop Gun: Maverick is a breathtaking blend of aerial spectacle, mentorship, and emotional depth.",
        "trailer": "https://www.youtube.com/embed/giXco2jaZ_4",
        "image": "../images/top_gun_maverick.jpg",
        "year": "2022",
        "imdb_rating": "8.3"
      }
     


]
  