[
    {
        "id": "breaking_bad",
        "title": "Breaking Bad",
        "genre": "Crime, Drama, Thriller",
        "director": "Vince Gilligan",
        "actors": "Bryan Cranston, Aaron Paul, Anna Gunn",
        "description": "Breaking Bad, masterfully crafted by Vince Gilligan, is an electrifying crime drama that redefines storytelling, plunging viewers into the harrowing journey of Walter White, a mild-mannered chemistry teacher turned ruthless methamphetamine kingpin, alongside his former student Jesse Pinkman. Available in crystal-clear 4K resolution, with a Full HD 1080p option for seamless viewing on any device.\n\nStricken with a terminal cancer diagnosis, Walt embarks on a desperate mission to secure his family’s financial future, using his scientific genius to cook near-perfect blue methamphetamine. Partnering with Jesse, a small-time dealer with a troubled past, Walt’s descent into the criminal underworld spirals into a web of danger, deception, and moral decay. As their drug empire expands, they face relentless drug lords, cunning DEA agents, and personal betrayals, with Walt’s alter ego, Heisenberg, emerging as a chilling symbol of his transformation. The series weaves a tapestry of intense action, psychological depth, and family turmoil, exploring themes of ambition, sacrifice, and the cost of power.\n\nFrom clandestine desert labs to explosive confrontations, Breaking Bad captivates with its meticulous plotting, richly developed characters, and cinematic brilliance. Each season escalates the stakes, blending heart-wrenching drama with dark humor and shocking twists, as Walt and Jesse grapple with the consequences of their choices. Universally lauded for its bold narrative and standout performances—particularly Cranston’s Emmy-winning portrayal of Walt—Breaking Bad is a cultural phenomenon that remains a pinnacle of modern television, offering an unflinching look at a man’s fall into darkness and the ripple effects on those around him.",
        "trailer": "https://www.youtube.com/embed/HhesaQXLuRY",
        "image": "../images/breaking_bad.jpg",
        "year": "2008-2013",
        "imdb_rating": "9.5"
      },
      {
        "id": "game_of_thrones",
        "title": "Game of Thrones",
        "genre": "Fantasy, Drama, Action",
        "director": "David Benioff, D.B. Weiss",
        "actors": "Emilia Clarke, Kit Harington, Peter Dinklage",
        "description": "Game of Thrones, adapted from George R.R. Martin’s sprawling A Song of Ice and Fire novels, is a monumental fantasy epic that reshaped television with its intricate storytelling and breathtaking scope. Available in stunning 4K for immersive visuals or Full HD 1080p for universal compatibility.\n\nSet in the mythical continents of Westeros and Essos, the series chronicles the brutal power struggles among noble families—Starks, Lannisters, Targaryens, and more—for control of the Iron Throne, the seat of the Seven Kingdoms. As political machinations unfold, an ancient evil, the White Walkers, emerges from the frozen North, threatening all life. Iconic characters like Daenerys Targaryen, the dragon-wielding exile, Jon Snow, the honorable bastard, and Tyrion Lannister, the cunning dwarf, navigate a treacherous world of alliances, betrayals, and warfare. The narrative weaves together themes of loyalty, vengeance, honor, and destiny, punctuated by shocking twists like the Red Wedding and epic battles such as the Battle of the Bastards.\n\nRenowned for its grandiose production, Game of Thrones boasts lavish sets, intricate costumes, and groundbreaking visual effects, bringing dragons, undead armies, and sprawling castles to life. Its complex, morally gray characters and unpredictable plotlines keep viewers on edge, while its exploration of power, family, and sacrifice resonates deeply. Despite controversy over its final season, the series’ cultural impact is undeniable, earning legions of fans and critical acclaim for its ambition and spectacle. Game of Thrones is a thrilling, unforgettable saga that blends mythic grandeur with gritty realism, cementing its place as a landmark in television history.",
        "trailer": "https://www.youtube.com/embed/KPLWWIOCOOQ",
        "image": "../images/game_of_thrones.jpg",
        "year": "2011-2019",
        "imdb_rating": "9.2"
      },
      {
        "id": "stranger_things",
        "title": "Stranger Things",
        "genre": "Science Fiction, Horror, Drama",
        "director": "The Duffer Brothers",
        "actors": "Winona Ryder, David Harbour, Millie Bobby Brown",
        "description": "Stranger Things, created by the Duffer Brothers, is a captivating sci-fi horror series that blends 1980s nostalgia with spine-chilling mystery, set in the small town of Hawkins, Indiana. Stream it in vivid 4K or Full HD 1080p for a thrilling experience on any screen.\n\nWhen young Will Byers vanishes, his friends Mike, Dustin, and Lucas uncover a web of supernatural secrets tied to a clandestine government lab, Hawkins National Laboratory. Their search leads them to Eleven, a telekinetic girl with a mysterious past, and the Upside Down, a shadowy alternate dimension teeming with monstrous creatures like the Demogorgon. As the kids band together, Will’s mother Joyce and Sheriff Jim Hopper confront paranormal forces and shadowy conspiracies to bring him home. The series masterfully balances heartwarming friendship, coming-of-age themes, and pulse-pounding horror, evoking the spirit of classic Spielberg films and Stephen King novels.\n\nStranger Things shines with its retro aesthetic—think neon bikes, walkie-talkies, and synth-heavy soundtracks—while delivering layered characters and emotional depth. From Dungeons & Dragons-inspired adventures to battles against mind-controlling entities, each season escalates the stakes, introducing new threats like the Mind Flayer and Soviet experiments. The ensemble cast, led by Millie Bobby Brown’s breakout role as Eleven, grounds the fantastical in raw human connection. A global phenomenon, Stranger Things has earned praise for its nostalgic charm, gripping suspense, and cultural references, making it a must-watch for fans of sci-fi, horror, and heartfelt storytelling.",
        "trailer": "https://www.youtube.com/embed/mnd7s0WYIto",
        "image": "../images/stranger_things.jpeg",
        "year": "2016-",
        "imdb_rating": "8.7"
      },
      {
        "id": "friends",
        "title": "Friends",
        "genre": "Comedy, Romance",
        "director": "David Crane, Marta Kauffman",
        "actors": "Jennifer Aniston, Courteney Cox, Lisa Kudrow",
        "description": "Friends, created by David Crane and Marta Kauffman, is a timeless sitcom that captures the hilarity and heart of six close-knit friends navigating life and love in New York City. Available in crisp 4K or Full HD 1080p for a vibrant rewatch experience.\n\nCentered around the iconic Central Perk coffee shop, the series follows Rachel Green, Ross Geller, Monica Geller, Chandler Bing, Joey Tribbiani, and Phoebe Buffay as they juggle careers, relationships, and endless comedic mishaps. From Ross’s infamous ‘pivot’ meltdown to Chandler’s sarcastic quips and Rachel’s journey from spoiled runaway to fashion professional, the show delivers laugh-out-loud moments and poignant milestones. Romantic arcs—like Ross and Rachel’s on-again, off-again saga—and quirky subplots, like Joey’s acting gigs and Phoebe’s eccentric songs, create a perfect blend of humor and warmth.\n\nWith its relatable themes of friendship, personal growth, and finding family in unlikely places, Friends resonates across generations. The ensemble’s chemistry, sharp writing, and iconic catchphrases (‘How you doin’?’) have made it a cultural touchstone, spawning countless memes and references. Set against a cozy 1990s backdrop of oversized sweaters and flip phones, the show’s 10-season run offers a comforting escape filled with heartfelt moments and enduring laughs. Universally beloved, Friends remains a cornerstone of comedy, inviting viewers to revisit the gang’s misadventures and celebrate the bonds that make life special.",
        "trailer": "https://www.youtube.com/embed/hDNNmeeJs1Q",
        "image": "../images/friends.jpg",
        "year": "1994-2004",
        "imdb_rating": "8.9"
      },
      {
        "id": "the_walking_dead",
        "title": "The Walking Dead",
        "genre": "Horror, Drama, Thriller",
        "director": "Frank Darabont",
        "actors": "Andrew Lincoln, Norman Reedus, Melissa McBride",
        "description": "The Walking Dead, adapted from Robert Kirkman’s comic series, is a gripping post-apocalyptic horror drama that explores survival in a world overrun by zombies. Available in haunting 4K or Full HD 1080p for an immersive viewing experience.\n\nLed by former sheriff Rick Grimes, a band of survivors navigates a desolate landscape filled with flesh-eating ‘walkers’ and dangerous human factions. From the early days of scavenging in Atlanta to building fragile communities like Alexandria, the group faces relentless threats, forcing tough moral choices and sacrifices. Key figures like Daryl Dixon, with his crossbow and fierce loyalty, and Carol Peletier, whose evolution from victim to warrior captivates, anchor the emotional core. The series blends visceral horror with deep character studies, examining hope, leadership, and humanity’s resilience in the face of despair.\n\nWith its gritty realism, shocking deaths, and sprawling ensemble, The Walking Dead delivers heart-pounding action—think walker hordes and brutal battles—alongside poignant drama. Each season introduces new challenges, from tyrannical leaders like Negan to whispered threats like the Whisperers, keeping tension high. The show’s cinematic visuals, from decaying urban ruins to blood-soaked fields, amplify its bleak atmosphere. A cultural juggernaut, The Walking Dead has spawned spin-offs and a massive fanbase, earning acclaim for its bold storytelling and exploration of what it means to survive when civilization crumbles.",
        "trailer": "https://www.youtube.com/embed/sfAc2U20ea0",
        "image": "../images/the_walking_dead.jpg",
        "year": "2010-2022",
        "imdb_rating": "8.1"
      },
      {
        "id": "sherlock",
        "title": "Sherlock",
        "genre": "Crime, Drama, Mystery",
        "director": "Mark Gatiss, Steven Moffat",
        "actors": "Benedict Cumberbatch, Martin Freeman",
        "description": "Sherlock, a modern reimagining of Arthur Conan Doyle’s classic detective stories, is a dazzling crime drama brimming with intellect and wit, created by Mark Gatiss and Steven Moffat. Available in sharp 4K or Full HD 1080p for a visually stunning experience.\n\nBenedict Cumberbatch stars as Sherlock Holmes, a brilliant but eccentric consulting detective in contemporary London, solving intricate mysteries with his keen observation and razor-sharp mind. Alongside Dr. John Watson, a loyal army veteran played by Martin Freeman, Sherlock tackles baffling cases—from serial killings to cryptic conspiracies—while clashing with foes like the diabolical Moriarty. Their dynamic partnership, blending Sherlock’s cold logic with Watson’s grounded humanity, forms the heart of the series, delivering both thrilling investigations and heartfelt moments.\n\nKnown for its clever writing, fast-paced storytelling, and innovative visuals—like text overlays for Sherlock’s deductions—Sherlock elevates the detective genre. Each episode, structured like a feature film, weaves intricate plots with emotional depth, exploring themes of friendship, genius, and obsession. The show’s sleek production, from moody London streets to high-stakes chases, immerses viewers in a world of suspense. A global hit, Sherlock earned critical acclaim for its stellar performances and modern flair, making it a must-watch for mystery fans and anyone craving a cerebral, stylish drama.",
        "trailer": "https://www.youtube.com/embed/IrBKwzL3K3s",
        "image": "../images/sherlock.jpg",
        "year": "2010-2017",
        "imdb_rating": "9.1"
      },
      {
        "id": "dexter",
        "title": "Dexter",
        "genre": "Crime, Drama, Thriller",
        "director": "Jeff Dunham",
        "actors": "Michael C. Hall, Jennifer Carpenter, David Zayas",
        "description": "Dexter, a chilling psychological thriller based on Jeff Lindsay’s novels, delves into the twisted mind of Dexter Morgan, a forensic blood-splatter analyst with a deadly secret. Available in gripping 4K or Full HD 1080p for an intense viewing experience.\n\nBy day, Dexter is a charming, meticulous expert working for Miami Metro Police; by night, he’s a vigilante serial killer who targets criminals who evade justice, guided by a strict moral code taught by his adoptive father, Harry. Balancing his ‘Dark Passenger’ with a façade of normalcy, Dexter navigates relationships with his sister Debra, colleagues, and romantic partners, all while evading suspicion from dogged detectives like Doakes and Batista. The series masterfully blends crime procedural elements with dark character drama, exploring themes of morality, identity, and the nature of evil.\n\nWith its taut suspense, Dexter keeps viewers on edge as he stalks his prey and dodges close calls, from tense cat-and-mouse games with the Ice Truck Killer to confrontations with cunning foes like the Trinity Killer. Michael C. Hall’s Emmy-nominated performance anchors the show, delivering a nuanced portrayal of a killer with a conscience. Set against Miami’s vibrant yet sinister backdrop, Dexter’s sleek visuals and haunting soundtrack amplify its unsettling tone. A cultural phenomenon, the series captivated audiences with its bold premise and moral ambiguity, cementing its status as a landmark thriller.",
        "trailer": "https://www.youtube.com/embed/YQeUmSD1ig0",
        "image": "../images/dexter.jpg",
        "year": "2006-2013",
        "imdb_rating": "8.6"
      },
      {
        "id": "the_boys",
        "title": "The Boys",
        "genre": "Action, Drama, Superhero",
        "director": "Eric Kripke",
        "actors": "Karl Urban, Jack Quaid, Antony Starr",
        "description": "The Boys, created by Eric Kripke and based on the comic by Garth Ennis and Darick Robertson, is a bold, irreverent superhero series that flips the genre on its head with dark humor and gritty action. Available in explosive 4K or Full HD 1080p for a visceral experience.\n\nIn a world where superheroes are corporate-controlled celebrities, the corrupt ‘Supes’—led by the sinister Homelander—wield unchecked power, often causing chaos. A ragtag vigilante group, The Boys, led by the gruff Billy Butcher and reluctant newcomer Hughie Campbell, takes on these flawed heroes, exposing their crimes and seeking justice. From Starlight’s disillusionment with fame to The Deep’s comical downfall, the series skewers superhero tropes while tackling themes of corruption, accountability, and resistance against systemic power.\n\nPacked with shocking violence, biting satire, and emotional depth, The Boys delivers jaw-dropping moments—like train derailments and exploding whales—alongside character-driven drama. Its sharp writing, dynamic ensemble, and high-octane action keep viewers hooked, while its critique of media, politics, and celebrity culture resonates deeply. Set in a gritty, hyper-realistic world, the show’s slick visuals and subversive tone make every episode a wild ride. A breakout hit, The Boys has redefined superhero storytelling, earning praise for its fearless approach and compelling mix of cynicism and heart.",
        "trailer": "https://www.youtube.com/embed/zAntYSe7qgs",
        "image": "../images/the_boys.jpg",
        "year": "2019-",
        "imdb_rating": "8.7"
      },
      {
        "id": "black_mirror",
        "title": "Black Mirror",
        "genre": "Science Fiction, Thriller, Anthology",
        "director": "Charlie Brooker",
        "actors": "Various",
        "description": "Black Mirror, created by Charlie Brooker, is a provocative sci-fi anthology series that holds a chilling mirror to society’s relationship with technology, delivering standalone tales of dystopian futures. Available in haunting 4K or Full HD 1080p for a visually striking experience.\n\nEach episode explores a unique, often unsettling premise—from brain-implanted memory chips in ‘The Entire History of You’ to a sinister social credit system in ‘Nosedive’—probing the ethical and psychological fallout of innovation. With rotating casts featuring stars like Bryce Dallas Howard and Jon Hamm, the series blends speculative fiction with biting social commentary, tackling themes of surveillance, artificial intelligence, virtual reality, and human nature’s darker impulses. Stories range from darkly comedic to deeply tragic, but all leave viewers questioning the cost of progress.\n\nKnown for its cerebral storytelling and twist-heavy plots, Black Mirror combines sleek, futuristic aesthetics with raw emotional stakes, creating an eerie yet captivating atmosphere. Episodes like ‘White Bear’ and ‘San Junipero’ have become cultural touchstones, sparking debates on morality and technology. The anthology format allows bold experimentation, with each tale offering fresh perspectives and unsettling surprises. A critical darling, Black Mirror has reshaped sci-fi television, earning acclaim for its visionary narratives and ability to predict chillingly plausible futures, making it essential viewing for those who dare to confront tomorrow’s shadows.",
        "trailer": "https://www.youtube.com/embed/jDiYGjp5iFg",
        "image": "../images/black_mirror.jpg",
        "year": "2011-",
        "imdb_rating": "8.8"
      },
      {
        "id": "loki",
        "title": "Loki",
        "genre": "Fantasy, Science Fiction, Action",
        "director": "Kate Herron",
        "actors": "Tom Hiddleston, Sophia Di Martino, Owen Wilson",
        "description": "Loki, a Marvel Cinematic Universe spin-off created by Michael Waldron, is a thrilling sci-fi fantasy series that follows the charismatic God of Mischief in a time-bending adventure. Available in vibrant 4K or Full HD 1080p for a dazzling visual experience.\n\nAfter stealing the Tesseract in Avengers: Endgame, Loki, played with roguish charm by Tom Hiddleston, is captured by the Time Variance Authority (TVA), a bureaucratic agency policing the multiverse’s timeline. Partnered with TVA agent Mobius and a mysterious variant, Sylvie, Loki unravels cosmic conspiracies, confronting his own nature as a trickster and the forces controlling reality itself. The series blends high-stakes action, witty banter, and existential questions about free will, destiny, and identity, all while expanding Marvel’s multiversal mythology.\n\nWith its retro-futuristic aesthetic, mind-bending plot twists, and dynamic character arcs, Loki captivates from start to finish. From time-loop interrogations to apocalyptic showdowns, the show balances spectacle with emotional depth, exploring Loki’s struggle for purpose and redemption. The chemistry between Hiddleston, Owen Wilson, and Sophia Di Martino elevates every scene, while the sleek production—think glowing time devices and sprawling TVA archives—immerses viewers in a unique corner of the MCU. A fan-favorite hit, Loki has earned praise for its bold storytelling and playful energy, making it a must-watch for Marvel enthusiasts and newcomers alike.",
        "trailer": "https://www.youtube.com/embed/nW948Va-l10",
        "image": "../images/loki.jpg",
        "year": "2021-",
        "imdb_rating": "8.2"
      },
      {
        "id": "squid_game",
        "title": "Squid Game",
        "genre": "Drama, Thriller, Survival",
        "director": "Hwang Dong-hyuk",
        "actors": "Lee Jung-jae, Park Hae-soo, Wi Ha-joon",
        "description": "Squid Game, a South Korean phenomenon created by Hwang Dong-hyuk, is a brutal, emotionally charged survival thriller that took the world by storm. Available in gripping 4K or Full HD 1080p for an intense, immersive experience.\n\nSeong Gi-hun, a down-on-his-luck father drowning in debt, joins 455 other desperate contestants in a mysterious competition for a massive cash prize. The catch? They must compete in deadly versions of childhood games like Red Light, Green Light and Tug-of-War, where losing means death. As alliances form and betrayals mount, Gi-hun navigates the psychological and physical toll, uncovering the sinister forces behind the game. The series weaves a scathing critique of capitalism, class disparity, and human desperation, blending visceral action with heart-wrenching character drama.\n\nWith its stark visuals—think eerie playgrounds and masked guards—Squid Game creates a haunting, unforgettable atmosphere. Standout performances, especially Lee Jung-jae’s raw portrayal of Gi-hun, ground the high-stakes narrative in emotional truth. Each game escalates the tension, delivering shocking twists and moral dilemmas that keep viewers glued to the screen. A global cultural juggernaut, Squid Game has sparked widespread discussion, inspired countless memes, and earned critical acclaim for its bold storytelling and universal themes, cementing its place as a landmark in modern television.",
        "trailer": "https://www.youtube.com/embed/oqxAJKy0ii4",
        "image": "../images/squid_game.jpg",
        "year": "2021-",
        "imdb_rating": "8.0"
      },
      {
        "id": "lost",
        "title": "Lost",
        "genre": "Drama, Mystery, Science Fiction",
        "director": "J.J. Abrams, Damon Lindelof",
        "actors": "Matthew Fox, Evangeline Lilly, Josh Holloway",
        "description": "Lost, created by J.J. Abrams, Damon Lindelof, and Jeffrey Lieber, is a groundbreaking mystery drama that blends survival, sci-fi, and supernatural elements, captivating audiences with its enigmatic storytelling. Available in mesmerizing 4K or Full HD 1080p for a vivid rewatch.\n\nWhen Oceanic Flight 815 crashes on a remote island, survivors like Jack Shephard, Kate Austen, and Sawyer Ford must band together to survive, facing polar bears, a smoke monster, and the island’s cryptic inhabitants, the Others. Through intricate flashbacks, flash-forwards, and flash-sideways, the series delves into each character’s past, revealing their secrets and connections. The island itself becomes a character, riddled with mysteries like the Dharma Initiative, time anomalies, and a hidden light at its heart, driving a narrative that explores fate, redemption, and human connection.\n\nWith its sprawling ensemble and non-linear storytelling, Lost delivers a rollercoaster of emotions, from heart-pounding survival sequences to poignant character arcs. The lush Hawaiian filming locations, paired with Michael Giacchino’s haunting score, create an immersive, otherworldly atmosphere. Iconic moments—like the hatch reveal and ‘We have to go back!’—have cemented its cultural legacy. Despite debates over its polarizing finale, Lost remains a trailblazer for its ambitious scope, complex mythology, and emotional depth, making it essential viewing for fans of puzzle-box narratives and character-driven drama.",
        "trailer": "https://www.youtube.com/embed/KTu8iDynwNc",
        "image": "../images/lost.jpg",
        "year": "2004-2010",
        "imdb_rating": "8.3"
      },
      {
        "id": "prison_break",
        "title": "Prison Break",
        "genre": "Action, Crime, Thriller",
        "director": "Paul Scheuring",
        "actors": "Wentworth Miller, Dominic Purcell, Sarah Wayne Callies",
        "description": "Prison Break, created by Paul Scheuring, is a pulse-pounding crime thriller that hooks viewers with its high-stakes action and intricate plotting, centered on a daring escape. Available in thrilling 4K or Full HD 1080p for an edge-of-your-seat experience.\n\nWhen Lincoln Burrows is wrongfully sentenced to death, his brilliant brother Michael Scofield, a structural engineer, orchestrates an elaborate plan to break him out of Fox River State Penitentiary. Michael tattoos the prison’s blueprints on his body, feigns a crime to get incarcerated, and navigates a web of dangerous inmates, corrupt guards, and external conspiracies. Alongside allies like Sucre and T-Bag, the brothers face relentless obstacles, from riots to manhunts, as they uncover a shadowy organization behind Lincoln’s frame-up. The series blends heart-pounding suspense with themes of loyalty, sacrifice, and redemption.\n\nWith its fast-paced narrative and shocking twists, Prison Break keeps viewers gripped through claustrophobic prison scenes and sprawling chases across multiple continents. Wentworth Miller’s stoic intensity as Michael and Dominic Purcell’s raw emotion as Lincoln anchor the emotional stakes, while the ensemble’s morally complex characters add depth. The show’s sleek visuals and relentless momentum make every episode a rollercoaster. A 2000s phenomenon, Prison Break earned a devoted fanbase and critical praise for its bold premise and addictive energy, making it a must-watch for thriller fans craving action and intrigue.",
        "trailer": "https://www.youtube.com/embed/AL9zLctDJaU",
        "image": "../images/prison_break.jpg",
        "year": "2005-2017",
        "imdb_rating": "8.3"
      },
      {
        "id": "vikings",
        "title": "Vikings",
        "genre": "Action, Drama, History",
        "director": "Michael Hirst",
        "actors": "Travis Fimmel, Katheryn Winnick, Alexander Ludwig",
        "description": "Vikings, created by Michael Hirst, is a visceral historical epic that immerses viewers in the brutal, adventurous world of Norse warriors, blending gritty action with rich mythology. Available in stunning 4K or Full HD 1080p for a cinematic experience.\n\nThe saga follows Ragnar Lothbrok, a legendary Viking farmer-turned-warrior, as he rises to power through daring raids on England and beyond, defying tradition and clashing with rivals like Earl Haraldson. Joined by his fierce wife Lagertha, brother Rollo, and sons like Bjorn Ironside, Ragnar’s ambitions spark epic battles, explorations, and family dramas. From the misty fjords of Kattegat to the blood-soaked fields of Wessex, the series weaves historical events with Norse gods and sagas, exploring themes of ambition, loyalty, and the clash of cultures.\n\nWith its breathtaking cinematography, authentic costumes, and intense combat sequences—think shield-wall clashes and axe-wielding duels—Vikings brings the Viking Age to life. The ensemble, led by Travis Fimmel’s magnetic Ragnar, delivers layered performances, balancing ferocity with vulnerability. As the series spans generations, it delves into power struggles, spiritual quests, and the cost of legacy, keeping viewers hooked with political intrigue and emotional weight. A global hit, Vikings has earned acclaim for its bold storytelling and immersive world-building, making it essential viewing for fans of historical dramas and epic adventures.",
        "trailer": "https://www.youtube.com/embed/9GgxinPweyc",
        "image": "../images/vikings.jpg",
        "year": "2013-2020",
        "imdb_rating": "8.5"
      },
      {
        "id": "attack_on_titan",
        "title": "Attack on Titan",
        "genre": "Anime, Action, Fantasy",
        "director": "Tetsurō Araki",
        "actors": "Yuki Kaji, Yui Ishikawa, Marina Inoue",
        "description": "Attack on Titan, based on Hajime Isayama’s manga and directed by Tetsurō Araki, is a dark, exhilarating anime epic that redefines the genre with its intense action and intricate lore. Available in vibrant 4K or Full HD 1080p for a visually spectacular experience.\n\nIn a post-apocalyptic world, humanity cowers behind massive walls to escape Titans, giant humanoid creatures that devour people without reason. When the Colossal Titan breaches Wall Maria, young Eren Yeager, his adoptive sister Mikasa Ackerman, and friend Armin Arlert join the Scout Regiment to fight back. Their journey uncovers shocking truths about the Titans, the walls, and a hidden history of oppression, propelling them into a brutal war against both monsters and human enemies. The series masterfully blends visceral combat with themes of freedom, sacrifice, and the moral cost of survival.\n\nKnown for its jaw-dropping animation—think fluid 3D maneuver gear battles and towering Titan clashes—Attack on Titan delivers heart-pounding action and emotional gut-punches. Its complex characters, from Eren’s fiery resolve to Levi Ackerman’s stoic badassery, drive a narrative filled with betrayals, political intrigue, and philosophical depth. The haunting soundtrack and stark visuals amplify its apocalyptic tone. A global phenomenon, Attack on Titan has captivated audiences with its relentless pacing and layered storytelling, earning critical acclaim as a modern anime masterpiece that appeals to both genre fans and newcomers.",
        "trailer": "https://www.youtube.com/embed/MGRm4IzK1SQ",
        "image": "../images/attack_on_titan.jpg",
        "year": "2013-2023",
        "imdb_rating": "9.0"
      },
      {
        "id": "the_witcher",
        "title": "The Witcher",
        "genre": "Fantasy, Action, Drama",
        "director": "Lauren Schmidt Hissrich",
        "actors": "Henry Cavill, Anya Chalotra, Freya Allan",
        "description": "The Witcher, adapted from Andrzej Sapkowski’s books and popularized by the video game series, is a sprawling fantasy epic created by Lauren Schmidt Hissrich, brimming with magic, monsters, and moral complexity. Available in vivid 4K or Full HD 1080p for an immersive experience.\n\nGeralt of Rivia, a gruff monster hunter with supernatural abilities, roams the Continent, slaying beasts while grappling with his outsider status. His destiny intertwines with Ciri, a young princess with hidden powers, and Yennefer, a fierce sorceress, as they navigate a war-torn world of kingdoms, elves, and dark forces. From battling grotesque creatures like the Striga to confronting scheming mages, the trio faces trials that test their bonds and convictions. The series weaves gritty action with themes of fate, family, and the cost of power, set against a richly detailed medieval-inspired backdrop.\n\nWith its stunning visuals—think misty forests and blood-soaked battlefields—The Witcher brings its fantastical world to life, bolstered by Henry Cavill’s commanding performance as Geralt. The non-linear storytelling, intricate lore, and morally gray characters keep viewers hooked, while epic fights and magical spectacles deliver thrilling highs. From tavern brawls to dragon hunts, the show balances visceral action with emotional depth. A global hit, The Witcher has earned praise for its ambitious scope and compelling adaptation, making it a must-watch for fantasy fans craving adventure and intrigue.",
        "trailer": "https://www.youtube.com/embed/ndl1W4ltcmg",
        "image": "../images/the_witcher.jpg",
        "year": "2019-",
        "imdb_rating": "8.0"
      },
      {
        "id": "money_heist",
        "title": "Money Heist",
        "genre": "Crime, Thriller, Drama",
        "director": "Álex Pina",
        "actors": "Úrsula Corberó, Álvaro Morte, Itziar Ituño",
        "description": "Money Heist, created by Álex Pina, is a heart-pounding Spanish crime thriller that captivated the world with its clever heists and emotional stakes, becoming a global phenomenon. Available in sharp 4K or Full HD 1080p for a thrilling viewing experience.\n\nMasterminded by the enigmatic Professor, a colorful crew of robbers—codenamed Tokyo, Rio, Nairobi, and more—executes audacious heists on Spain’s Royal Mint and Bank of Spain, aiming for billions while outsmarting police and hostages. Using intricate plans, psychological tactics, and red jumpsuits, they navigate high-stakes stand-offs, betrayals, and personal dramas. The series blends edge-of-your-seat action with deep character arcs, exploring themes of resistance, loyalty, and the blurred line between hero and criminal, all while delivering sharp social commentary on inequality and corruption.\n\nWith its kinetic pacing, Money Heist keeps viewers glued through nail-biting sequences—like tunnel digs and SWAT raids—paired with emotional flashbacks that reveal the robbers’ motivations. The vibrant ensemble, led by Álvaro Morte’s calculating Professor, brings charisma and heart, while iconic symbols like Dalí masks and ‘Bella Ciao’ became cultural touchstones. Shot in sleek, cinematic style, the show’s tension and flair make every episode a rollercoaster. A Netflix juggernaut, Money Heist has earned critical acclaim and a massive fanbase for its addictive storytelling and bold execution, making it essential for thriller fans craving heist drama with soul.",
        "trailer": "https://www.youtube.com/embed/_InqQJRqGW4",
        "image": "../images/money_heist.jpg",
        "year": "2017-2021",
        "imdb_rating": "8.2"
      },
      {
        "id": "daredevil",
        "title": "Daredevil",
        "genre": "Action, Crime, Superhero",
        "director": "Drew Goddard",
        "actors": "Charlie Cox, Deborah Ann Woll, Elden Henson",
        "description": "Daredevil, a Marvel series created by Drew Goddard, is a gritty, character-driven superhero drama that redefines the genre with its raw intensity and moral complexity. Available in dynamic 4K or Full HD 1080p for a visually gripping experience.\n\nBlinded as a child but gifted with heightened senses, Matt Murdock leads a double life in Hell’s Kitchen, New York: by day, a principled lawyer fighting for justice alongside partner Foggy Nelson; by night, the masked vigilante Daredevil, battling crime with brutal martial arts. Facing kingpins like Wilson Fisk and mystical threats like the Hand, Matt grapples with his Catholic faith, inner rage, and the cost of his crusade. The series weaves visceral action with deep emotional stakes, exploring themes of justice, redemption, and the toll of vigilantism in a corrupt city.\n\nKnown for its jaw-dropping fight scenes—like the iconic single-take hallway brawl—Daredevil delivers cinematic choreography and grounded storytelling. Charlie Cox’s nuanced performance anchors the show, supported by a stellar cast, including Vincent D’Onofrio’s chilling Fisk. The moody, neon-lit visuals and intense pacing create a noir-infused atmosphere, setting it apart from typical superhero fare. A critical and fan favorite, Daredevil has earned praise for its bold narrative, complex characters, and integration into the Marvel Cinematic Universe, making it a must-watch for fans of action-packed drama with heart and grit.",
        "trailer": "https://www.youtube.com/embed/jAy6NJ_D5vU",
        "image": "../images/daredevil.jpg",
        "year": "2015-2018",
        "imdb_rating": "8.6"
      },
      {
        "id": "narcos",
        "title": "Narcos",
        "genre": "Crime, Drama, Biography",
        "director": "Chris Brancato, Carlo Bernard",
        "actors": "Wagner Moura, Boyd Holbrook, Pedro Pascal",
        "description": "Narcos, created by Chris Brancato, Carlo Bernard, and Doug Miro, is a riveting crime drama that chronicles the real-life rise and fall of drug cartels, blending historical grit with intense storytelling. Available in vivid 4K or Full HD 1080p for an immersive experience.\n\nThe series begins with Pablo Escobar, the infamous Colombian drug lord, as he builds the Medellín Cartel into a global empire, flooding the world with cocaine while evading DEA agents Steve Murphy and Javier Peña. Through visceral action and political intrigue, Narcos depicts the bloody war between cartels, governments, and law enforcement, later shifting to the Cali Cartel and Mexico’s drug trade. The show balances high-stakes chases and shootouts with nuanced character studies, exploring themes of power, corruption, and the human cost of the drug war.\n\nWith its documentary-style narration and authentic Latin American settings, Narcos immerses viewers in the 1980s and 1990s underworld, from Medellín’s slums to Bogotá’s corridors of power. Wagner Moura’s magnetic portrayal of Escobar and Pedro Pascal’s steely Peña anchor the ensemble, delivering raw emotion and moral complexity. The show’s cinematic visuals—think lush jungles and tense raids—pair with a pulsating soundtrack to amplify its gritty tone. A global hit, Narcos has earned acclaim for its bold storytelling and historical insight, making it essential viewing for fans of crime dramas and true-story sagas.",
        "trailer": "https://www.youtube.com/embed/xl8zdCY-abw",
        "image": "../images/narcos.jpeg",
        "year": "2015-2017",
        "imdb_rating": "8.8"
      },
      {
        "id": "dark",
        "title": "Dark",
        "genre": "Science Fiction, Thriller, Mystery",
        "director": "Baran bo Odar, Jantje Friese",
        "actors": "Louis Hofmann, Karoline Eichhorn, Lisa Vicari",
        "description": "Dark, a German sci-fi thriller created by Baran bo Odar and Jantje Friese, is a mind-bending masterpiece that unravels a complex web of time travel and family secrets. Available in haunting 4K or Full HD 1080p for a visually immersive experience.\n\nSet in the small town of Winden, the series begins with a child’s disappearance, which exposes a labyrinth of interconnected lives across multiple generations. As families like the Nielsens, Dopplers, and Tiedemanns grapple with loss, teenagers Jonas Kahnwald and Martha Nielsen uncover a time-travel conspiracy tied to a local nuclear plant and a mysterious cave. Spanning decades—from 1953 to 2053—Dark weaves a tapestry of parallel worlds, temporal loops, and existential questions about fate, free will, and identity, delivering twists that challenge perceptions of reality.\n\nWith its intricate plotting and atmospheric visuals—think rainy forests and eerie bunkers—Dark creates a brooding, cerebral tone, amplified by a haunting soundtrack. The ensemble cast, led by Louis Hofmann’s anguished Jonas, delivers raw, layered performances, grounding the sci-fi in human emotion. Each season escalates the stakes, introducing apocalyptic stakes and philosophical depth, making it a puzzle-box narrative that rewards close attention. A critical darling, Dark has captivated global audiences with its bold vision and meticulous storytelling, earning acclaim as one of the most ambitious sci-fi series ever, perfect for fans of complex mysteries and time-travel dramas.",
        "trailer": "https://www.youtube.com/embed/rrwycJ08PSA",
        "image": "../images/dark.jpg",
        "year": "2017-2020",
        "imdb_rating": "8.7"
      },
      {
        "id": "arrow",
        "title": "Arrow",
        "genre": "Action, Superhero, Drama",
        "director": "Greg Berlanti",
        "actors": "Stephen Amell, Katie Cassidy, David Ramsey",
        "description": "Arrow, created by Greg Berlanti and based on DC Comics’ Green Arrow, is a gripping superhero drama that blends high-octane action with personal redemption, launching the Arrowverse. Available in dynamic 4K or Full HD 1080p for a thrilling visual experience.\n\nAfter surviving five years stranded on a brutal island, billionaire playboy Oliver Queen returns to Starling City with a mission: to become the hooded vigilante Green Arrow and save his city from corruption. Armed with a bow and unmatched combat skills, Oliver targets criminals while hiding his identity from friends and family, including his sister Thea and friend Tommy Merlyn. As he battles mobsters, metahumans, and villains like Deathstroke and Ra’s al Ghul, Oliver grapples with his traumatic past and the moral cost of his crusade, forging alliances with allies like John Diggle and Felicity Smoak.\n\nWith its intense fight choreography, emotional depth, and serialized storytelling, Arrow delivers a grounded take on superheroics, exploring themes of justice, family, and sacrifice. Stephen Amell’s brooding performance anchors the show, supported by a dynamic ensemble that evolves across its eight seasons. The sleek urban visuals and high-stakes missions—from rooftop chases to citywide threats—create an immersive atmosphere. A trailblazer for comic-book TV, Arrow spawned multiple spin-offs and earned a devoted fanbase for its compelling arcs and crossover events, making it a must-watch for superhero fans and drama enthusiasts alike.",
        "trailer": "https://www.youtube.com/embed/hHZmWouH6k4",
        "image": "../images/arrow.jpg",
        "year": "2012-2020",
        "imdb_rating": "7.5"
      },
      {
        "id": "fargo",
        "title": "Fargo",
        "genre": "Crime, Drama, Thriller",
        "director": "Noah Hawley",
        "actors": "Billy Bob Thornton, Martin Freeman, Allison Tolman",
        "description": "Fargo, created by Noah Hawley and inspired by the Coen Brothers’ 1996 film, is a darkly comedic crime anthology that weaves quirky, chilling tales of greed and violence in the snowy Midwest. Available in crisp 4K or Full HD 1080p for a visually striking experience.\n\nEach season introduces a new story, from a drifter’s deadly influence on a small-town insurance salesman in Season 1 to a mob war in 1950s Kansas City in Season 4. Characters like Lorne Malvo, Lester Nygaard, and Peggy Blumquist navigate bizarre crimes, inept criminals, and dogged law enforcement, all tied by the Coen-esque blend of humor, tragedy, and moral ambiguity. Set in Minnesota and beyond, the series explores themes of human nature, fate, and the ripple effects of bad choices, delivering standalone yet interconnected narratives.\n\nWith its sharp writing, stellar casts—featuring stars like Billy Bob Thornton, Kirsten Dunst, and Chris Rock—and meticulous production, Fargo captivates through eccentric dialogue, shocking twists, and memorable moments, like UFO sightings and fish tornadoes. The stark, snow-covered visuals and eclectic soundtrack amplify its quirky yet menacing tone. A critical darling, Fargo has earned multiple Emmys for its bold storytelling and Coen Brothers homage, making it essential viewing for fans of crime dramas, black comedy, and anthology series craving richly crafted stories with a biting edge.",
        "trailer": "https://www.youtube.com/embed/H0H3TJRi-1Y",
        "image": "../images/fargo.jpg",
        "year": "2014-",
        "imdb_rating": "8.9"
      },
      {
        "id": "death_note",
        "title": "Death Note",
        "genre": "Anime, Mystery, Thriller",
        "director": "Tetsurō Araki",
        "actors": "Mamoru Miyano, Brad Swaile, Ryô Naitô",
        "description": "Death Note, adapted from Tsugumi Ohba and Takeshi Obata’s manga and directed by Tetsurō Araki, is a gripping psychological anime thriller that explores the seductive pull of absolute power. Available in vibrant 4K or Full HD 1080p for a visually intense experience.\n\nHigh school prodigy Light Yagami discovers the Death Note, a supernatural notebook dropped by the Shinigami Ryuk, which allows him to kill anyone by writing their name while picturing their face. Light embarks on a crusade to eliminate criminals as the god-like ‘Kira,’ sparking a global manhunt led by the enigmatic detective L. Their cat-and-mouse game escalates into a battle of wits, manipulation, and moral decay, as Light’s ideals twist into megalomania and L employs unorthodox tactics to catch him. The series masterfully blends suspense, philosophy, and supernatural horror, probing themes of justice, morality, and the corrupting nature of power.\n\nWith its taut pacing, intricate plotting, and striking animation—think shadowy Shinigami realms and tense interrogations—Death Note keeps viewers on edge. The voice performances, especially Mamoru Miyano’s chilling Light, amplify the psychological intensity, while the iconic soundtrack, with its operatic flair, heightens the drama. From clever gambits to shocking betrayals, every episode is a high-stakes chess match. A cultural phenomenon, Death Note has influenced anime and pop culture, earning acclaim for its bold narrative and intellectual depth, making it a must-watch for fans of thrillers and anime alike.",
        "trailer": "https://www.youtube.com/embed/NlJZ-YgAt-c",
        "image": "../images/death_note.jpg",
        "year": "2006-2007",
        "imdb_rating": "9.0"
      },
      {
        "id": "the_lord_of_the_rings",
        "title": "The Lord of the Rings: The Rings of Power",
        "genre": "Fantasy, Adventure, Drama",
        "director": "J.D. Payne, Patrick McKay",
        "actors": "Morfydd Clark, Robert Aramayo, Charlie Vickers",
        "description": "The Lord of the Rings: The Rings of Power, created by J.D. Payne and Patrick McKay, is an ambitious fantasy epic set thousands of years before J.R.R. Tolkien’s The Lord of the Rings, bringing Middle-earth’s Second Age to life. Available in breathtaking 4K or Full HD 1080p for a visually spectacular experience.\n\nIn a time of relative peace, elf warrior Galadriel hunts for signs of a resurgent evil, while diverse characters—humans, dwarves, elves, and harfoots—navigate a world on the brink of chaos. As the dark lord Sauron forges the Rings of Power to dominate all, unlikely heroes like Elrond, Durin IV, and Arondir confront political intrigue, ancient prophecies, and monstrous threats like orcs and sea creatures. The series weaves grand adventure with themes of hope, unity, and the seductive pull of power, expanding Tolkien’s lore with new stories and familiar legends.\n\nWith its jaw-dropping production—think lush Númenor cityscapes and misty Khazad-dûm mines—The Rings of Power delivers cinematic splendor, rivaling Peter Jackson’s films. The ensemble, led by Morfydd Clark’s fierce Galadriel, brings emotional depth to a sprawling narrative, while epic battles and mystical visuals captivate. From harfoot migrations to elven councils, the show balances intimate character moments with world-shaking stakes. A record-breaking Amazon series, The Rings of Power has sparked debate but earned praise for its ambition and fidelity to Tolkien’s spirit, making it a must-watch for fantasy fans and Middle-earth devotees.",
        "trailer": "https://www.youtube.com/embed/f2Cs_u4b6hI",
        "image": "../images/the_lord_of_the_rings.jpg",
        "year": "2022-",
        "imdb_rating": "7.0"
      },
      {
        "id": "brooklyn_nine_nine",
        "title": "Brooklyn Nine-Nine",
        "genre": "Comedy, Crime",
        "director": "Dan Goor, Michael Schur",
        "actors": "Andy Samberg, Stephanie Beatriz, Terry Crews",
        "description": "Brooklyn Nine-Nine, created by Dan Goor and Michael Schur, is a hilarious and heartfelt sitcom that transforms the police procedural into a comedic gem, set in a chaotic Brooklyn precinct. Available in vibrant 4K or Full HD 1080p for a laugh-filled rewatch.\n\nDetective Jake Peralta, a talented but immature cop, leads a quirky squad under the stern yet caring Captain Raymond Holt. From Rosa Diaz’s tough exterior to Terry Jeffords’ yogurt-loving strength and Amy Santiago’s Type-A precision, the 99th precinct tackles cases and personal antics with equal gusto. Whether chasing petty thieves or pulling elaborate Halloween heists, the team’s tight-knit bond shines through pranks, rivalries, and life milestones, like Jake and Amy’s romance. The series blends sharp humor with themes of friendship, diversity, and growth, addressing social issues with wit and heart.\n\nWith its fast-paced gags, memorable catchphrases (‘Noice!’), and stellar ensemble chemistry, Brooklyn Nine-Nine delivers endless laughs and surprising depth. The show’s vibrant Brooklyn setting and clever writing make every episode a joy, from absurd cold opens to emotional arcs like Holt’s leadership struggles. A cultural favorite, it has earned acclaim for its inclusive representation and balance of silliness and sincerity, winning multiple awards and a devoted fanbase. Brooklyn Nine-Nine is a must-watch for comedy fans craving a feel-good series with big laughs and bigger heart.",
        "trailer": "https://www.youtube.com/embed/sEOuJ4z5aTc",
        "image": "../images/brooklyn_nine_nine.jpg",
        "year": "2013-2021",
        "imdb_rating": "8.4"
      },
      {
        "id": "peaky_blinders",
        "title": "Peaky Blinders",
        "genre": "Crime, Drama, History",
        "director": "Steven Knight",
        "actors": "Cillian Murphy, Paul Anderson, Helen McCrory",
        "description": "Peaky Blinders, created by Steven Knight, is a stylish, gripping crime saga that immerses viewers in the gritty underworld of post-World War I Birmingham, England, led by a magnetic antihero. Available in cinematic 4K or Full HD 1080p for a visually stunning experience.\n\nThe Shelby family, headed by the cunning Thomas ‘Tommy’ Shelby, runs the Peaky Blinders, a razor-wielding gang named for their signature caps. From illegal betting to gun-running, Tommy expands their empire, clashing with rivals like Italian mobs, Russian aristocrats, and even the British government. Alongside siblings Arthur and Ada, and allies like Polly Gray, Tommy navigates love, betrayal, and trauma, using his sharp mind and haunted past to outwit enemies like Luca Changretta and Oswald Mosley. The series blends historical drama with themes of power, family loyalty, and the scars of war, set against a smoky, industrial backdrop.\n\nWith its slick cinematography, period costumes, and a modern rock soundtrack—think Nick Cave and The White Stripes—Peaky Blinders delivers a visceral, intoxicating vibe. Cillian Murphy’s chilling yet vulnerable Tommy anchors the ensemble, driving a narrative packed with political intrigue, bloody turf wars, and emotional depth. From tense shootouts to quiet moments of reflection, the show balances spectacle with character-driven storytelling. A global phenomenon, Peaky Blinders has earned acclaim for its bold aesthetic and layered drama, making it a must-watch for fans of crime epics and historical sagas.",
        "trailer": "https://www.youtube.com/embed/oVzV7V8EQ44",
        "image": "../images/peaky_blinders.jpg",
        "year": "2013-2022",
        "imdb_rating": "8.8"
      },
      {
        "id": "house_of_cards",
        "title": "House of Cards",
        "genre": "Drama, Political, Thriller",
        "director": "Beau Willimon",
        "actors": "Kevin Spacey, Robin Wright, Michael Kelly",
        "description": "House of Cards, created by Beau Willimon and adapted from the British series, is a chilling political thriller that dissects the ruthless pursuit of power in Washington, D.C., with Shakespearean intensity. Available in sharp 4K or Full HD 1080p for a gripping experience.\n\nFrank Underwood, a cunning Democratic congressman, and his equally ambitious wife Claire orchestrate a Machiavellian rise to the White House, manipulating politicians, journalists, and allies like Doug Stamper with chilling precision. From backroom deals to calculated betrayals, the Underwoods navigate scandals, rivalries, and moral compromises, leaving a trail of destruction. The series breaks the fourth wall, with Frank’s direct addresses pulling viewers into his twisted psyche, while exploring themes of ambition, loyalty, and the corrupting nature of power in a cynical political landscape.\n\nWith its taut scripting, stellar performances—led by Kevin Spacey’s Emmy-nominated Frank and Robin Wright’s icy Claire—and sleek visuals, House of Cards delivers a masterclass in suspense and character drama. The show’s polished D.C. settings, from dimly lit offices to gala events, amplify its tense atmosphere, while plot twists keep audiences guessing. A Netflix pioneer, House of Cards redefined streaming television, earning critical acclaim and a massive following for its bold narrative and unflinching portrayal of political machinations, making it essential viewing for fans of drama and intrigue.",
        "trailer": "https://www.youtube.com/embed/ULwUzF1NQSs",
        "image": "../images/house_of_cards.jpg",
        "year": "2013-2018",
        "imdb_rating": "8.6"
      },
      {
        "id": "better_call_saul",
        "title": "Better Call Saul",
        "genre": "Crime, Drama, Comedy",
        "director": "Vince Gilligan, Peter Gould",
        "actors": "Bob Odenkirk, Rhea Seehorn, Jonathan Banks",
        "description": "Better Call Saul, a masterful Breaking Bad prequel created by Vince Gilligan and Peter Gould, is a character-driven crime drama with sharp wit and heartbreaking depth, tracing the origin of fan-favorite lawyer Saul Goodman. Available in vivid 4K or Full HD 1080p for an immersive experience.\n\nSet in early 2000s Albuquerque, the series follows Saul—then Jimmy McGill—a small-time lawyer hustling to make a name while grappling with his conman past as ‘Slippin’ Jimmy.’ Alongside his love interest Kim Wexler, a brilliant attorney, and his estranged brother Chuck, a legal titan, Jimmy navigates shady clients, cartel dealings, and personal demons. Familiar faces like Mike Ehrmantraut and Gus Fring tie the story to Breaking Bad, as Jimmy’s moral slide into Saul unfolds with tragic inevitability, blending dark comedy with themes of identity, loyalty, and ambition.\n\nWith its meticulous writing, Better Call Saul delivers a slower burn than its predecessor, focusing on nuanced character arcs and legal maneuvering, punctuated by bursts of suspense—like cartel shootouts and courtroom gambits. Bob Odenkirk’s Emmy-nominated performance, paired with Rhea Seehorn’s standout Kim, anchors the emotional core, while the show’s vibrant visuals and quirky humor shine. From neon-lit strip malls to tense depositions, every frame is crafted with care. A critical darling, Better Call Saul has earned praise as a worthy companion to Breaking Bad, offering a poignant, thrilling journey for fans of character studies and crime dramas.",
        "trailer": "https://www.youtube.com/embed/HN4oydykJFc",
        "image": "../images/better_call_saul.jpg",
        "year": "2015-2022",
        "imdb_rating": "9.0"
      },
      {
        "id": "the_office",
        "title": "The Office",
        "genre": "Comedy, Mockumentary",
        "director": "Greg Daniels",
        "actors": "Steve Carell, John Krasinski, Jenna Fischer",
        "description": "The Office, adapted by Greg Daniels from the British series, is a hilarious and heartfelt mockumentary sitcom that transforms the mundane world of a Scranton paper company into comedy gold. Available in crisp 4K or Full HD 1080p for a vibrant rewatch experience.\n\nAt Dunder Mifflin, bumbling manager Michael Scott leads a quirky staff, including prankster Jim Halpert, earnest Pam Beesly, and intense Dwight Schrute, through sales calls, office romances, and absurd workplace antics. From chili spills to fire drills, the show captures the hilarity of cubicle life while weaving emotional arcs, like Jim and Pam’s slow-burn romance and Michael’s quest for family among his employees. The mockumentary format, with talking-head confessions and shaky camerawork, grounds the absurdity in relatability, exploring themes of friendship, ambition, and finding joy in the everyday.\n\nWith its razor-sharp writing, iconic cold opens, and stellar ensemble—led by Steve Carell’s cringe-worthy yet lovable Michael—The Office delivers endless laughs and surprising depth. Memorable episodes, like ‘Dinner Party’ and ‘The Dundies,’ have become cultural touchstones, spawning memes and quotes (‘That’s what she said!’). The show’s cozy Scranton setting and early-2000s aesthetic amplify its charm. A comedy juggernaut, The Office won multiple Emmys and a devoted fanbase for its perfect blend of humor and heart, making it a must-watch for anyone craving laughter and workplace camaraderie.",
        "trailer": "https://www.youtube.com/embed/LHOtME2DL9g",
        "image": "../images/the_office.jpg",
        "year": "2005-2013",
        "imdb_rating": "9.0"
      },
      {
        "id": "suits",
        "title": "Suits",
        "genre": "Drama, Legal, Comedy",
        "director": "Aaron Korsh",
        "actors": "Gabriel Macht, Patrick J. Adams, Meghan Markle",
        "description": "Suits, created by Aaron Korsh, is a slick, charismatic legal drama that blends high-stakes courtroom battles with sharp wit and stylish flair, set in the cutthroat world of New York law. Available in vibrant 4K or Full HD 1080p for a polished viewing experience.\n\nHarvey Specter, a suave, top-tier attorney at Pearson Hardman, hires Mike Ross, a brilliant college dropout with a photographic memory but no law degree, as his associate. Together, they tackle high-profile cases—mergers, fraud, corporate takeovers—while hiding Mike’s secret from colleagues like the formidable Jessica Pearson and rival Louis Litt. As they navigate office politics, romantic entanglements, and ethical dilemmas, their mentor-protégé bond grows, tested by betrayals and firm shake-ups. The series weaves legal intrigue with themes of loyalty, ambition, and reinvention, all wrapped in a glossy, fast-talking package.\n\nWith its snappy dialogue, tailored suits, and dynamic pacing, Suits delivers addictive drama, from tense depositions to witty banter. Gabriel Macht’s magnetic Harvey and Patrick J. Adams’ earnest Mike anchor a stellar cast, including Meghan Markle’s fierce Rachel Zane. The show’s sleek Manhattan offices and jazzy soundtrack create an aspirational vibe, while character arcs add surprising depth. A fan-favorite hit, Suits ran for nine seasons, earning praise for its engaging plots and charismatic leads, making it a must-watch for fans of legal dramas, workplace intrigue, and stylish storytelling.",
        "trailer": "https://www.youtube.com/embed/85z53bAebsI",
        "image": "../images/suits.jpg",
        "year": "2011-2019",
        "imdb_rating": "8.4"
      },
      {
        "id": "ozark",
        "title": "Ozark",
        "genre": "Crime, Drama, Thriller",
        "director": "Bill Dubuque, Mark Williams",
        "actors": "Jason Bateman, Laura Linney, Sofia Hublitz",
        "description": "Ozark, created by Bill Dubuque and Mark Williams, is a tense, slow-burn crime thriller that plunges a family into the dark heart of money laundering, blending gritty drama with psychological depth. Available in moody 4K or Full HD 1080p for an immersive experience.\n\nMarty Byrde, a Chicago financial planner, relocates his wife Wendy and kids to the Missouri Ozarks after a deal with a Mexican cartel goes awry. Tasked with laundering millions to save his family, Marty navigates dangerous alliances with local criminals like the Snells, the volatile Langmores, and cartel enforcer Navarro. As Wendy’s political ambitions grow and their daughter Charlotte and son Jonah grapple with their new life, the Byrdes’ moral compromises spiral, testing their unity and survival. The series explores themes of greed, family, and the cost of ambition in a world where trust is scarce.\n\nWith its taut pacing and morally gray characters, Ozark delivers gripping suspense, from high-stakes negotiations to explosive betrayals. Jason Bateman’s understated Marty and Laura Linney’s ruthless Wendy anchor the show, supported by Julia Garner’s Emmy-winning Ruth Langmore. The Ozarks’ misty lakes and shadowy woods create a brooding atmosphere, amplified by a haunting score. A Netflix standout, Ozark has earned critical acclaim for its intense storytelling and complex dynamics, drawing comparisons to Breaking Bad while carving its own path, making it essential for fans of crime dramas and character-driven thrillers.",
        "trailer": "https://www.youtube.com/embed/5hAXVqrljbs",
        "image": "../images/ozark.jpg",
        "year": "2017-2022",
        "imdb_rating": "8.5"
      },
      {
        "id": "the_blacklist",
        "title": "The Blacklist",
        "genre": "Crime, Drama, Thriller",
        "director": "Jon Bokenkamp",
        "actors": "James Spader, Megan Boone, Diego Klattenhoff",
        "description": "The Blacklist, created by Jon Bokenkamp, is a high-octane crime thriller that blends mystery, action, and intrigue, centered on a charismatic master criminal and his uneasy alliance with the FBI. Available in sharp 4K or Full HD 1080p for a thrilling experience.\n\nRaymond ‘Red’ Reddington, a notorious fugitive, surrenders to the FBI with an offer: he’ll help catch the world’s most dangerous criminals from his secret ‘blacklist,’ but only if he works with rookie profiler Elizabeth Keen. From terrorists to assassins, Red’s cryptic motives and encyclopedic knowledge drive a cat-and-mouse game, unraveling conspiracies tied to Liz’s past and global cabals. Alongside agents like Donald Ressler and Aram Mojtabai, they navigate betrayals, double-crosses, and Red’s shadowy empire, exploring themes of trust, identity, and the blurred line between hero and villain.\n\nWith its twist-heavy plots and James Spader’s mesmerizing, Emmy-nominated performance as Red, The Blacklist keeps viewers hooked through high-stakes missions, from undercover ops to explosive raids. The sleek visuals, spanning urban hideouts to international locales, amplify the tension, while the ensemble’s chemistry adds emotional weight. From Red’s dapper charm to Liz’s evolving strength, the show balances serialized mysteries with standalone cases. A long-running hit, The Blacklist has earned a devoted fanbase for its addictive pacing and intricate storytelling, making it a must-watch for fans of crime thrillers and espionage dramas.",
        "trailer": "https://www.youtube.com/embed/-WY0RwrBuEc",
        "image": "../images/blacklist.jpg",
        "year": "2013-2023",
        "imdb_rating": "8.0"
      },
      {
        "id": "how_i_met_your_mother",
        "title": "How I Met Your Mother",
        "genre": "Comedy, Romance",
        "director": "Carter Bays, Craig Thomas",
        "actors": "Josh Radnor, Neil Patrick Harris, Cobie Smulders",
        "description": "How I Met Your Mother, created by Carter Bays and Craig Thomas, is a heartfelt, laugh-out-loud sitcom that weaves a clever romantic mystery with the warmth of friendship, set in vibrant New York City. Available in crisp 4K or Full HD 1080p for a nostalgic rewatch.\n\nIn 2030, Ted Mosby narrates to his kids the story of how he met their mother, flashing back to 2005 when he and friends Marshall Eriksen, Lily Aldrin, Robin Scherbatsky, and Barney Stinson navigated love, careers, and hilarious misadventures. From Ted’s hopeless romantic quests to Barney’s outrageous playbook schemes and Marshall and Lily’s sweet partnership, the gang’s escapades at MacLaren’s Pub spark endless laughs and emotional moments. The series blends nonlinear storytelling with themes of destiny, growth, and the search for ‘the one,’ keeping viewers guessing about the mother’s identity.\n\nWith its sharp writing, iconic catchphrases (‘Legen—wait for it—dary!’), and stellar ensemble—led by Neil Patrick Harris’s scene-stealing Barney—How I Met Your Mother delivers comedy gold, from slap bets to yellow umbrellas. The cozy NYC setting and early-2000s vibe amplify its charm, while heartfelt arcs, like Robin’s career struggles, add depth. Despite debate over its finale, the show’s clever structure and emotional resonance made it a cultural staple, earning acclaim and a massive fanbase. A must-watch for comedy fans, it’s a warm, witty journey through love and friendship.",
        "trailer": "https://www.youtube.com/embed/RU7eJhuSKHA",
        "image": "../images/how_i_met_your_mother.jpg",
        "year": "2005-2014",
        "imdb_rating": "8.3"
      },
      {
        "id": "house_md",
        "title": "House M.D.",
        "genre": "Drama, Medical, Mystery",
        "director": "David Shore",
        "actors": "Hugh Laurie, Omar Epps, Robert Sean Leonard",
        "description": "House M.D., created by David Shore, is a brilliant medical drama that combines razor-sharp wit, gripping mysteries, and deep character studies, centered on a flawed genius doctor. Available in vivid 4K or Full HD 1080p for an immersive experience.\n\nDr. Gregory House, a misanthropic but unparalleled diagnostician, leads a team at Princeton-Plainsboro Hospital, solving baffling medical cases that stump other doctors. With his unorthodox methods—think risky procedures and biting sarcasm—House tackles diseases from rare infections to bizarre syndromes, often clashing with colleagues like Dr. Lisa Cuddy and friend Dr. James Wilson. His team, including Cameron, Chase, and Foreman, navigates his abrasive style while unraveling personal dramas. The series blends procedural puzzles with themes of morality, addiction, and human connection, driven by House’s complex psyche and painkiller dependency.\n\nWith its clever scripting and Hugh Laurie’s Emmy-nominated performance as the caustic yet magnetic House, the show delivers addictive medical whodunits and emotional depth. From tense operating rooms to whiteboard brainstorming, each case is a high-stakes riddle, paired with character arcs like House’s turbulent romance with Cuddy. The sleek hospital setting and snappy dialogue create a dynamic vibe. A 2000s phenomenon, House M.D. earned critical acclaim and a massive fanbase for its bold storytelling and philosophical undertones, making it a must-watch for fans of medical dramas and character-driven mysteries.",
        "trailer": "https://www.youtube.com/embed/au7SokC6jZw",
        "image": "../images/house_md.jpg",
        "year": "2004-2012",
        "imdb_rating": "8.7"
      },
      {
        "id": "the_mandalorian",
        "title": "The Mandalorian",
        "genre": "Science Fiction, Action, Adventure",
        "director": "Jon Favreau",
        "actors": "Pedro Pascal, Gina Carano, Giancarlo Esposito",
        "description": "The Mandalorian, created by Jon Favreau, is a thrilling Star Wars series that blends space Western grit with heartwarming adventure, introducing one of the franchise’s most iconic characters. Available in stunning 4K or Full HD 1080p for a cinematic experience.\n\nSet after the Empire’s fall, the series follows Din Djarin, a lone Mandalorian bounty hunter, who takes a high-stakes job to retrieve a mysterious target: a baby Yoda-like creature named Grogu. Defying his guild’s code, Din becomes Grogu’s protector, embarking on a galaxy-spanning quest through lawless worlds, from Tatooine’s deserts to Nevarro’s volcanic outposts. Facing bounty hunters, Imperial remnants, and allies like Cara Dune and Moff Gideon, Din uncovers secrets about his Mandalorian heritage and Grogu’s Jedi ties. The series weaves action, lore, and themes of honor, family, and redemption.\n\nWith its jaw-dropping visuals—think practical sets and cutting-edge LED stages—The Mandalorian delivers Star Wars at its best, from blaster shootouts to lightsaber duels. Pedro Pascal’s stoic yet soulful Din, paired with Grogu’s irresistible charm, anchors the emotional core, while cameos from Luke Skywalker and Ahsoka Tano thrill fans. The episodic structure and John Williams-inspired score amplify its Western vibe. A cultural phenomenon, The Mandalorian has earned Emmys and universal praise for revitalizing Star Wars, making it a must-watch for sci-fi fans and anyone craving epic, heartfelt adventure.",
        "trailer": "https://www.youtube.com/embed/aOC8E8z_ifw",
        "image": "../images/the_mandalorian.jpg",
        "year": "2019-",
        "imdb_rating": "8.7"
      },
      {
        "id": "arcane",
        "title": "Arcane",
        "genre": "Animation, Action, Fantasy",
        "director": "Christian Linke, Alex Yee",
        "actors": "Hailee Steinfeld, Ella Purnell, Kevin Alejandro",
        "description": "Arcane, created by Christian Linke and Alex Yee and based on Riot Games’ League of Legends, is a visually stunning animated series that redefines storytelling with its rich world and emotional depth. Available in breathtaking 4K or Full HD 1080p for a vibrant experience.\n\nSet in the steampunk city of Piltover and the gritty undercity of Zaun, the series follows sisters Vi and Powder, whose lives diverge amid class tensions and a magical substance called Hextech. As inventors like Jayce and Viktor push technological boundaries, crime lords and rebels like Caitlyn and Jinx spark conflict, weaving a tale of loyalty, betrayal, and societal divide. From underground fight clubs to glittering council chambers, Arcane explores themes of family, power, and the cost of progress, delivering a narrative that resonates beyond its game origins.\n\nWith its jaw-dropping animation—blending hand-painted textures and dynamic 3D—Arcane sets a new standard, with every frame bursting with detail, from neon-lit alleys to explosive battles. The voice cast, led by Hailee Steinfeld’s fierce Vi and Ella Purnell’s tragic Powder, delivers raw emotion, while the haunting soundtrack amplifies the stakes. From heart-wrenching flashbacks to epic showdowns, the series balances action with character-driven drama. A critical and cultural triumph, Arcane won Emmys and universal acclaim for its universal appeal, making it a must-watch for animation fans and storytelling enthusiasts alike.",
        "trailer": "https://www.youtube.com/embed/4Ps6nV4xCEg",
        "image": "../images/arcane.jpg",
        "year": "2021-",
        "imdb_rating": "9.0"
      },
      {
        "id": "bodyguard",
        "title": "Bodyguard",
        "genre": "Drama, Thriller, Political",
        "director": "Jed Mercurio",
        "actors": "Richard Madden, Sophie Rundle, Gina McKee",
        "description": "Bodyguard, created by Jed Mercurio, is a heart-pounding British political thriller that weaves high-stakes suspense with raw emotional depth, centered on a troubled war veteran. Available in sharp 4K or Full HD 1080p for an intense viewing experience.\n\nDavid Budd, a stoic protection officer and PTSD-afflicted veteran, is assigned to guard Julia Montague, a controversial Home Secretary pushing divisive anti-terrorism policies. As Budd navigates a web of conspiracies, from train bombings to assassination attempts, he grapples with his fractured personal life, including a strained marriage and his duty to his children. Suspicion mounts as allies and enemies blur, forcing Budd to uncover a shadowy plot threatening the government. The series blends pulse-pounding action with themes of duty, trauma, and political corruption, delivering a taut narrative that keeps viewers guessing.\n\nWith its relentless pacing and Richard Madden’s BAFTA-winning performance as Budd, Bodyguard captivates through explosive set pieces—like a sniper ambush—and intimate character moments. The sleek London settings, from Whitehall’s corridors to gritty safehouses, amplify the tension, while tight scripting delivers shocking twists. Mercurio’s knack for layered storytelling shines, balancing personal drama with national stakes. A BBC and Netflix hit, Bodyguard became a global sensation, earning praise for its gripping intensity and realistic portrayal of security and politics, making it a must-watch for fans of thrillers and character-driven dramas.",
        "trailer": "https://www.youtube.com/embed/IjJ65r8xWqM",
        "image": "../images/bodyguard.jpg",
        "year": "2018",
        "imdb_rating": "8.1"
      },
      {
        "id": "you",
        "title": "You",
        "genre": "Thriller, Drama, Romance",
        "director": "Greg Berlanti, Sera Gamble",
        "actors": "Penn Badgley, Victoria Pedretti, Ambyr Childers",
        "description": "You, created by Greg Berlanti and Sera Gamble and based on Caroline Kepnes’ novel, is a chilling psychological thriller that explores the dark side of obsession and modern romance. Available in gripping 4K or Full HD 1080p for an unsettling experience.\n\nJoe Goldberg, a charming bookstore manager, hides a dangerous secret: he’s a stalker and serial killer who fixates on women, believing he’s their savior. Starting with aspiring writer Guinevere Beck, Joe uses social media and manipulation to infiltrate their lives, eliminating anyone who threatens his twisted vision of love. As his obsessions shift to new targets like Love Quinn, Joe’s façade of normalcy crumbles, revealing a cycle of violence and self-delusion. The series blends suspense, dark humor, and social commentary, probing themes of toxic relationships, privacy, and the masks people wear.\n\nWith its taut pacing and Penn Badgley’s mesmerizing performance, You keeps viewers hooked through creepy voyeurism, shocking murders, and psychological twists. The sleek urban settings—think NYC lofts and L.A. suburbs—contrast Joe’s sinister actions, while the voiceover narration pulls audiences into his warped mind. From locked cages to bloody betrayals, each season escalates the stakes, keeping the narrative fresh. A Netflix phenomenon, You has sparked cultural debates and earned acclaim for its addictive storytelling and nuanced take on obsession, making it a must-watch for thriller fans and those intrigued by love’s darker edges.",
        "trailer": "https://www.youtube.com/embed/ga0iTWXCGa0",
        "image": "../images/you.jpg",
        "year": "2018-",
        "imdb_rating": "7.7"
      },
    {
      "id": "the_queens_gambit",
      "title": "The Queen's Gambit",
      "genre": "Drama, Sports",
      "director": "Scott Frank",
      "actors": "Anya Taylor-Joy, Bill Camp, Marielle Heller",
      "description": "The Queen's Gambit, a chess prodigy’s tale, captivates. Available in 4K and 1080p.\n\nBeth Harmon rises in the 1960s chess world, battling addiction and sexism. Stylish, emotional, and gripping, it’s a triumph.\n\nA brilliant, inspiring drama.",
      "trailer": "https://www.youtube.com/embed/CDrieqwSdgI",
      "image": "../images/the_queens_gambit.jpg",
      "year": "2020",
      "imdb_rating": "8.5"
    },
    {
      "id": "house_of_the_dragon",
      "title": "House of the Dragon",
      "genre": "Fantasy, Drama, Action",
      "director": "Ryan Condal, George R.R. Martin",
      "actors": "Matt Smith, Emma D’Arcy, Rhys Ifans",
      "description": "House of the Dragon, a Game of Thrones prequel, dives into Targaryen history. Available in 4K and 1080p.\n\nCivil war looms as dragon-riding royals vie for power. Epic, fiery, and political, it’s a worthy successor.\n\nA grand, dragon-fueled epic.",
      "trailer": "https://www.youtube.com/embed/DotnJ7tTA34",
      "image": "../images/house_of_the_dragon.jpeg",
      "year": "2022-",
      "imdb_rating": "8.5"
    },
    {
      "id": "the_crown",
      "title": "The Crown",
      "genre": "Drama, History, Biography",
      "director": "Peter Morgan",
      "actors": "Claire Foy, Olivia Colman, Imelda Staunton",
      "description": "The Crown, a regal drama, chronicles Queen Elizabeth II’s reign. Available in 4K and 1080p.\n\nFrom personal struggles to political crises, the series blends history and humanity. Lavish, nuanced, and gripping, it’s royal storytelling.\n\nA majestic historical saga.",
      "trailer": "https://www.youtube.com/embed/JWtnJjn6ng0",
      "image": "../images/the_crown.jpg",
      "year": "2016-2023",
      "imdb_rating": "8.6"
    },
    {
      "id": "lupin",
      "title": "Lupin",
      "genre": "Crime, Drama, Mystery",
      "director": "George Kay, François Uzan",
      "actors": "Omar Sy, Ludivine Sagnier, Hervé Pierre",
      "description": "Lupin, a French heist series, reimagines a classic thief. Available in 4K and 1080p.\n\nAssane Diop, inspired by Arsène Lupin, seeks revenge through clever cons. Charismatic, stylish, and fun, it’s a modern caper.\n\nA sleek, thrilling ride.",
      "trailer": "https://www.youtube.com/embed/ga0iTWXCGa0",
      "image": "../images/lupin.jpg",
      "year": "2021-",
      "imdb_rating": "7.5"
    },
    {
      "id": "rick_and_morty",
      "title": "Rick and Morty",
      "genre": "Animation, Comedy, Science Fiction",
      "director": "Dan Harmon, Justin Roiland",
      "actors": "Justin Roiland, Chris Parnell, Spencer Grammer",
      "description": "Rick and Morty, an animated sci-fi comedy, is wildly inventive. Available in 4K and 1080p.\n\nGenius Rick drags grandson Morty on cosmic misadventures. Absurd humor, clever plots, and heart shine.\n\nA hilarious, mind-bending gem.",
      "trailer": "https://www.youtube.com/embed/BKYJ5AIOU9I",
      "image": "../images/rick_and_morty.jpg",
      "year": "2013-",
      "imdb_rating": "9.1"
    },
    {
      "id": "manifest",
      "title": "Manifest",
      "genre": "Drama, Mystery, Science Fiction",
      "director": "Jeff Rake",
      "actors": "Melissa Roxburgh, Josh Dallas, J.R. Ramirez",
      "description": "Manifest, a mystery drama, follows a flight’s strange fate. Available in 4K and 1080p.\n\nPassengers of Flight 828 face time anomalies and cryptic callings. Emotional, twisty, and layered, it’s a puzzle.\n\nA compelling, supernatural drama.",
      "trailer": "https://www.youtube.com/embed/I1hNAIzkQWY",
      "image": "../images/manifest.jpg",
      "year": "2018-2023",
      "imdb_rating": "7.1"
    }
]